{
  "name": "DHIS2",
  "description": "DHIS2 is a free, open-source, fully customizable platform for collecting, analyzing, visualizing, and sharing aggregate and individual-data for district-level, national, regional, and international system and program management in health, education, and other domains.",
  "licensing": "Categorized as open-source software, the codebase is hosted on a publicly available repository (Github) and uses an OSI licence (BSD-3-Clause: 3-clause BSD License).",
  "sdgRelevance": "Has relevance to SDGs: \na. 3 - Good Health and Well-being \nb. 4 - Quality Education \nc. 17 - Partnerships to achieve the Goal",
  "ownership": "Ownership of DHIS2 is clearly defined and documented with evidence of applicable copyright.",
  "clearOwnership": "Ownership of DHIS2 is clearly defined and documented with evidence of applicable copyright.",
  "platformIndependence": "DHIS2 is software platform independent hence does not have mandatory dependencies (i.e. libraries, hardware) that create more restrictions than the original license.",
  "documentation": "DHIS2 documentation is extensive, well structured, highly organized() and up-to-date. It is also translated into five languages: English, French, Spanish, Portuguese, Czech hence able to reach a wider audience. The documentation is organized into the following categories: User, Implementer, Developer, Sysadmin; hence caters for the needs of different knowledge workers adequately providing both functional and technical documentation. Documentation is easily distributable as downloadable PDFs.",
  "extractionMechanism": "DHIS2 collects non-personally identifiable information (non-PII) data and can be extracted using the DHIS2 Web API and via the Import-Export App within DHIS2.",
  "privacyAdherenceApplicableLaws": "DHIS2 complies with relevant privacy laws such as GDPR and relevant Norwegian legislation. For countries using the DHIS2 software in other regions are responsible for complying with local legislation. \n DHIS2 complies with applicable international and domestic laws such as GDPR and relevant Norwegian legislation. For countries using the DHIS2 software in other regions are responsible for complying with local legislation.",
  "standardsAdherenceBestPractices": "DHIS2 supports the following standards and provides evidence for the standards support: FHIR, SNOMED GPS, LOINC, CVX, ADX, ICD-10, ICD-11, mCSD and SVCM. \n DHIS2 acknowledges the project was developed according to the following principles and best practices among others:\na. Principles for Digital Development \nb. Agile development process, \nc. Frequent releases \nd. Development in close collaboration with end users \ne. Early delivery of working software \nf. Emphasis on simplicity.",
  "doNoHarm": "DHIS2 takes steps to anticipate, prevent and do no harm through striving to adhere to best practices for data security and privacy, in accordance with local laws. However, it should be noted that proper adherence to these is the responsibility of each individual organization that implements the DHIS2 software, since each instance of the software is locally owned and maintained, and the DHIS2 core team does not have access to individual country databases.",
  "dataPrivacySecurity": "PII collected varies per country, based on program needs and privacy regulations. Some examples include: name, date of birth, address, contact information, national ID number. DHIS2 does not share the data with 3rd parties. To guarantee data security it features configurable access control, database encryption and defining metadata as public or private.",
  "inappropriateIllegalContent": "DHI2 does not collect, store or distribute content.",
  "harrassmentProtection": "DHIS2 facilitates interactions between users and helps protect underage users by setting the age limit for participation on the forum to 13 or older. DHIS2 also takes steps to help protect users and contributors against grief, abuse and harassment by having the DHIS2 discussion forum governed by clearly stated community guidelines and actively moderated by members of the DHIS2 core team.",
  "developmentDeploymentCountries": "DHIS2 was developed in 2 countries distributed across Europe and Africa. The project is presently deployed in 74 countries distributed across the world."
}
