{
  "name": "Kindly",
  "clearOwnership": {
    "isOwnershipExplicit": "Yes",
    "copyrightURL": "https://unicef.github.io/kindly/acknowledgements"
  },
  "platformIndependence": {
    "mandatoryDepsCreateMoreRestrictions": "No"
  },
  "documentation": {
    "isDocumentationAvailable": "Yes",
    "documentationURL": [
      "https://unicef.github.io/kindly"
    ]
  },
  "NonPII": {
    "collectsNonPII": "No"
  },
  "privacy": {
    "isPrivacyCompliant": "Yes",
    "privacyComplianceList": [
      "UNICEF’s Policy on Conduct Promoting the Protection and Safeguarding of Children",
      "UNICEF’s Policy On Personal DATA PROTECTION "
    ],
    "adherenceSteps": [
      "https://kindly.unicef.io/contribute"
    ]
  },
  "standards": {
    "supportStandards": "Yes",
    "implementBestPractices": "Yes",
    "standardsList": [
      "HTML",
      "CSS",
      "JavaScript",
      "REST API's"
    ],
    "bestPracticesList": [
      "Child Safeguarding Principles according to UNICEF including 1) The wellbeing of the child is the most important consideration - Kindly’s vision is to improve children’s wellbeing by combating cyberbullying; 2) All children have the same right to be protected, regardless of their gender, culture, ethnicity, age, religion or abilities - Kindly is available to be integrated onto any platform; 3) Information is managed as confidential - Kindly doesn’t collect any data unless the user wishes to contribute to the training data set in which the data is reviewed and anonymized such that no confidential data is stored permanently or shared. ",
      "Child Safeguarding Principles according to UNICEF including 1) The wellbeing of the child is the most important consideration - Kindly’s vision is to improve children’s wellbeing by combating cyberbullying; 2) All children have the same right to be protected, regardless of their gender, culture, ethnicity, age, religion or abilities - Kindly is available to be integrated onto any platform; 3) Information is managed as confidential - Kindly doesn’t collect any data unless the user wishes to contribute to the training data set in which the data is reviewed and anonymized such that no confidential data is stored permanently or shared. "
    ]
  },
  "doNoHarm": {
    "preventHarm": {
      "stepsToPreventHarm": "Yes",
      "additionalInfoMechanismProcessesPolicies": "Even though we do not collect any PII, a user may provide this information by accident while contributing to the training data set. In order to mitigate this risk and avoid any harm to that information, only authorized UNICEF employees will have access to the raw version of the training data. If a user provides any PII by accident, then the authorized team member will safely remove and permanently destroy/delete it prior to including the submission in the public-facing data set."
    },
    "dataPrivacySecurity": {
      "collectsPII": "No"
    },
    "inappropriateIllegalContent": {
      "collectStoreDistribute": "Yes",
      "type": "Kindly provides users feedback on whether their message or string of text has cyberbullying intent or not. We plan on growing the data set consisting of words and phrases that may be considered cyberbullying. So if users wish (this is optional), they may contribute by responding to prompts such as “Was the presentation okay? I couldn’t tell” in an effort to add to the training data set and improve the machine learning model. They also have the chance to agree or disagree with Kindly’s feedback. Thus, this information is collected (strings of text provided by the user and the user’s agreement/disagreement with Kindly’s feedback on it).",
      "contentFilter": "No",
      "illegalContentDetection": "Yes",
      "illegalContentDetectionMechanism": "Any data submitted by users through the message box is reviewed by authorized UNICEF employees. They will safely remove and destroy any inappropriate or illegal content, not relevant for Kindly’s intended purposes. UNICEF employees will review the contribution data once a day. An internal process has been created for this. "
    },
    "protectionFromHarassment": {
      "userInteraction": "Yes",
      "addressSafetySecurityUnderageUsers": "Yes",
      "griefAbuseHarassmentProtection": "Yes",
      "stepsAddressRiskPreventSafetyUnderageUsers": [
        "Kindly was created for children between the ages of 10 and 18 years in an effort to end cyberbullying and make them feel safer. If users are under 13 years old, they are asked to make sure they have the permission of their parents or guardian prior to giving us any information. This information is highlighted on https://kindly.unicef.io/contribute. Anyone under 18 is also strongly encouraged to discuss their participation with their parents or guardian."
      ],
      "harassmentProtectionSteps": [
        "Kindly’s aim is to bring an end to cyberbullying by providing children with feedback on their messages so that they can reconsider them before sending and avoid abuse, harassment, and cyberharm. If users have any concerns on their data protection or on Kindly’s functionality, they can reach out to kindly@unicef.org. "
      ]
    }
  },
  "locations": {
    "developmentCountries": [
      "United States of America"
    ],
    "deploymentCountries": [
      "United States of America"
    ]
  }
}
