{
  "name": "Kiva Protocol",
  "clearOwnership": {
    "isOwnershipExplicit": "Unknown"
  },
  "platformIndependence": {
    "mandatoryDepsCreateMoreRestrictions": "No"
  },
  "documentation": {
    "isDocumentationAvailable": "Yes",
    "documentationURL": [
      "https://protocol-docs.web.app/"
    ]
  },
  "NonPII": {
    "collectsNonPII": "No"
  },
  "privacy": {
    "isPrivacyCompliant": "Unknown"
  },
  "standards": {
    "supportStandards": "Yes",
    "standardsList": [
      "Developers for this project have been active in the development of the W3C Verifiable Credentials specification, the W3C Decentralized Identifier specification, the DIDComms specification incubated at the Decentralized Identity Foundation, and other identity communications specification work hosted in the Aries RFC repository. Test support work is ongoing, as many of these specifications are still in incubation and evolving."
    ],
    "implementBestPractices": "Yes",
    "bestPracticesList": [
      "Kiva Protocol has been awarded the ID2020 Certification Mark, and won the World Bank ID4D’s Mission Billion Challenge Global Prize. Its design and operational model embodies best practices around privacy, agency, and open and standards-based technologies, and specifically adheres to the ID4D Principles of Identification.  Though it isn’t formally measured, the community also actively seeks to support Privacy by Design and principles of data minimization and non-correlation so that users can have confidence sharing data between issuers. The Core Infrastructure Initiative badge is a part of certifying the components of the system that are part of Hyperledger and project results can be found here https://bestpractices.coreinfrastructure.org/en/projects/4088."
    ]
  },
  "doNoHarm": {
    "preventHarm": {
      "stepsToPreventHarm": "Yes"
    },
    "dataPrivacySecurity": {
      "collectsPII": "Unknown"
    },
    "inappropriateIllegalContent": {
      "collectStoreDistribute": "No"
    },
    "protectionFromHarassment": {
      "userInteraction": "Yes"
    }
  },
  "locations": {
    "developmentCountries": [
      "United States of America"
    ],
    "deploymentCountries": [
      "Sierra Leone"
    ]
  }
}
