{
  "name": "Lexsitus",
  "clearOwnership": {
    "isOwnershipExplicit": "Yes",
    "copyrightURL": "https://cilrap-lexsitus.org/copyright"
  },
  "platformIndependence": {
    "mandatoryDepsCreateMoreRestrictions": "No",
    "isSoftwarePltIndependent": "",
    "pltIndependenceDesc": ""
  },
  "documentation": {
    "isDocumentationAvailable": "Yes",
    "documentationURL": [
      "Tutorials - https://www.legal-tools.org/tutorials",
      "Help and tutorials - https://cilrap-lexsitus.org/help"
    ]
  },
  "NonPII": {
    "collectsNonPII": "Yes",
    "checkNonPIIAccessMechanism": "Yes",
    "nonPIIAccessMechanism": "The ICC Case Matrix and legal tools database support downloads in PDF format including metadata - https://www.cilrap.org/cilrap-film/220426-ltd-3/"
  },
  "privacy": {
    "isPrivacyCompliant": "Yes",
    "privacyComplianceList": [
      "GDPR."
    ],
    "adherenceSteps": [
      "https://cilrap-lexsitus.org/privacy"
    ]
  },
  "standards": {
    "supportStandards": "Yes",
    "standardsList": [
      "PDF"
    ],
    "evidenceStandardSupport": [
      "https://www.legal-tools.org/"
    ],
    "implementBestPractices": "Yes",
    "bestPracticesList": [
      "All Principles for Digital Development have been followed in the conceptualisation, development and continued operation of Lexsitus. In addition, Lexsitus will not, in any manner whatsoever, harm the fundamental human rights of anyone as defined under the International Covenant on Civil and Political Rights. Moreover, Lexsitus will fully observe the principle of equality and non-discrimination and not in any way discriminate on the basis of grounds such as religion, race, ethnicity, nationality or sexual orientation. Furthermore, the platform will not in any way contribute to harm to our shared natural environment.",
      "As a further principle, Lexsitus has been built to indefinitely provide free and quality legal education and information service to anyone with access to the Internet, regardless of their geographical location. Lexsitus will remain non-profit and open access. As such, Lexsitus is aligned with Goal 4 of the Sustainable Development Goals (‘SDGs’) (that is, it will 'ensure inclusive and equitable quality education and promote lifelong learning opportunities for all').",
      "Furthermore, the service of Lexsitus is directly aimed at Goal 16 of the SDGs (that is, to “promote peaceful and inclusive societies for sustainable development, provide access to justice for all and build effective, accountable and inclusive institutions at all levels”). Through the freely available educational and legal-information content, Lexsitus aims to equip individuals with knowledge of international criminal law, so they may ensure that there is accountability for core international crimes in their societies, organisations and countries."
    ]
  },
  "doNoHarm": {
    "preventHarm": {
      "stepsToPreventHarm": "Yes",
      "additionalInfoMechanismProcessesPolicies": "Users cannot add content. There is an editorial team with strict control of publish ability."
    },
    "dataPrivacySecurity": {
      "collectsPII": "Yes",
      "typesOfDataCollected": [
        "Lexsitus can be used without registering. However, if users wish to use a reading list function, they can optionally register (https://cilrap-lexsitus.org/register). ",
        "There is also an optional 'Report Issue' function which registers name and e-mail address."
      ],
      "thirdPartyDataSharing": "No",
      "dataSharingCircumstances": [
        ""
      ],
      "ensurePrivacySecurity": "Yes",
      "privacySecurityDescription": "Privacy policy - https://cilrap-lexsitus.org/privacy"
    },
    "inappropriateIllegalContent": {
      "collectStoreDistribute": "Yes",
      "type": "Lexsitus only stores legal sources in international criminal law, structured in accordance with the Statute and Rules of Procedure and Evidence of the International Criminal Court. The sources fall in one of seven categories of resources or services: \n(1) AV-recorded lectures; \n(2) a textual commentary; \n(3) a collection of preparatory documents produced by states during the making of the Statute of the International Criminal Court; \n(4) decisions by international courts on international criminal law; \n(5) the ICC Elements of Crime document (on the definition of international crimes) adopted by states; \n (6) an Elements Digest with extracts from international judgments defining international crimes; and \n (7) a Means of Proof Digest with extracts from international judgments on how international crimes can be proved in practice. Services (1), (3) and (5) are more or less static. Services (2), (4), (6) and (7) are developed by the Lexsitus team in light of new judgments by international courts.",
      "contentFilter": "Yes",
      "policyGuidelinesDocumentationLink": "The policy is zero tolerance of any illegal or inappropriate content as commonly understood, and to maintain Lexsitus in such a way that it continues to be impossible for such content to be added to Lexsitus. These are among the relevant elements of the policy: \n(a) All content in Lexsitus is added by the Lexsitus team itself, pursuant to its system of quality-control; \n(b) it is not possible for actors external to the Lexsitus team legally or technically to add any content to Lexsitus; \n(c) services (1) and (2) referred to above are produced in their entirety by the Lexsitus team; \n(d) the judgments added to services (4), (6) and (7) are issued by international courts, the preeminent law-enforcement institutions of the world established to uphold the highest international legal standards; \n(e) these judgments are selected by the Lexsitus team itself, using the official version of the judgment as released by the international court in question; \n (f) in order to be relevant for inclusion in Lexsitus, any content must speak to one or more provisions of the ICC Statute or Rules of Procedure and Elements which make up the content-spine of everything in Lexsitus (available on the far left on the Lexsitus operational page)",
      "illegalContentDetection": "Yes",
      "illegalContentDetectionMechanism": "For the reasons explained above, no actor external to the Lexsitus team can add content to Lexsitus, and documents produced outside Lexsitus and subsequently added to it are official versions of judgments of international courts selected by the Lexsitus team. The work of members of the Lexsitus team are subjected to rigorous, multi-level quality-control. Working-level Lexsitus team-members cannot themselves publish material on Lexsitus. A small number of editors must approve and trigger all publication. All editors are accountable to the creator of Lexsitus, the Director of CILRAP. The editorial team is and will remain very small. All Lexsitus editors and other team members are lawyers, except the IT-experts of Mithya Labs who provide technical support and development work, and who are also accountable for all their work on Lexsitus to the Director of CILRAP. Any user of Lexsitus can report suspected issues (technical or content-wise) to the Lexsitus team through a designated feature. Lexsitus content has never been questioned."
    },
    "protectionFromHarassment": {
      "userInteraction": "No",
      "addressSafetySecurityUnderageUsers": "",
      "stepsAddressRiskPreventSafetyUnderageUsers": [
        ""
      ],
      "griefAbuseHarassmentProtection": "",
      "harassmentProtectionSteps": [
        ""
      ]
    }
  },
  "locations": {
    "developmentCountries": [
      "Belgium",
      "India",
      "United States of America"
    ],
    "deploymentCountries": [
      "India",
      "Italy",
      "United States of America"
    ]
  }
}
