{
  "name": "Sunbird Obsrv",
  "clearOwnership": {
    "isOwnershipExplicit": "Yes",
    "copyrightURL": "https://sunbird.org/software-license"
  },
  "platformIndependence": {
    "mandatoryDepsCreateMoreRestrictions": "No",
    "isSoftwarePltIndependent": "",
    "pltIndependenceDesc": ""
  },
  "documentation": {
    "isDocumentationAvailable": "Yes",
    "documentationURL": [
      "https://obsrv.sunbird.org"
    ]
  },
  "NonPII": {
    "collectsNonPII": "Yes",
    "checkNonPIIAccessMechanism": "Yes",
    "nonPIIAccessMechanism": "Sunbird Obsrv is an open-source software available under MIT License. To enable various actions via analysis of data, the system may store any data that the adopter chooses to generate or collect. The decision as to what data to generate, or what user data to collect lies entirely with the adopter and the specific problems that they set out to solve via the digital platforms. Sunbird Obsrv has APIs and tools to capture, collect, stream, process, aggregate and securely store the data thus generated by the platform.  Data validation, aggregation, and management of datasets are enabled both via tools as well as APIs.\n"
  },
  "privacy": {
    "isPrivacyCompliant": "Yes",
    "privacyComplianceList": [
      "India's Personal Data Protection Bill (2019)",
      "The IT Act (2000) for its implementation in India"
    ],
    "adherenceSteps": [
      "Privacy policy: https://www.sunbird.org/privacy-policy",
      "Terms & conditions: https://www.sunbird.org/terms-conditions"
    ]
  },
  "standards": {
    "supportStandards": "Yes",
    "standardsList": [
      ""
    ],
    "evidenceStandardSupport": [
      ""
    ],
    "implementBestPractices": "Yes",
    "bestPracticesList": [
      "https://sunbird.org/explore/articles/2-thinking-microservice-architecture",
      "Versionable Telemetry specification with backward compatibility for data processing : https://telemetry.sunbird.org Data pipeline built using Lambda architecture with both real-time and batch processing capabilities. Data durability - Decoupling of various components of the data pipeline with durable messaging queues as a fail-safe design. Data Security - Protection of private information using data anonymization techniques. Accessibility - Self service tools for report generation."
    ]
  },
  "doNoHarm": {
    "preventHarm": {
      "stepsToPreventHarm": "Yes",
      "additionalInfoMechanismProcessesPolicies": "As an open source-code solution, Sunbird Obsrv has source code that is open, free and available to all interested implementers/adopters (on GitHub). Individual implementations may have their own view of how they may have addressed data management (PII/non-PII), hosting of the solution and so forth.  Management of PII/non-PII data in Sunbird is purely a “highly extensible/configurable/non-opinionated open-software solution”, and it’s source code lies in GitHub (Sunbird is not a ‘hosted service or product’). Implementers/adopters of Sunbird, have the autonomy to decide “what” fields to be capture/maintain, “what” other systems will they integrate with, “will” they share this data with other authorized parties (e.g. one Government sharing this dataset with other Government, or one Department sharing this dataset with other Department). While the Sunbird technical architecture has taken privacy and security controls into consideration as default implementation, it is up to the Implementers/Adopters to establish a privacy policy at their end to cover the various implementation scenarios (e.g. management & sharing of PII/non PII data). All the data in the system can only be accessed using APIs which are protected by authorization tokens. Multi-tenancy support is provided out of the box, and the data of a specific tenant cannot be accessed by another tenant. No PIA information is stored as part of the telemetry events, and care is taken to not denormalise any PIA information."
    },
    "dataPrivacySecurity": {
      "collectsPII": "No",
      "typesOfDataCollected": [
        ""
      ],
      "thirdPartyDataSharing": "No",
      "dataSharingCircumstances": [
        ""
      ],
      "ensurePrivacySecurity": "Yes",
      "privacySecurityDescription": "Privacy policy: https://www.sunbird.org/privacy-policy"
    },
    "inappropriateIllegalContent": {
      "collectStoreDistribute": "No",
      "type": "",
      "contentFilter": "",
      "policyGuidelinesDocumentationLink": "",
      "illegalContentDetection": "",
      "illegalContentDetectionMechanism": ""
    },
    "protectionFromHarassment": {
      "userInteraction": "No",
      "addressSafetySecurityUnderageUsers": "",
      "stepsAddressRiskPreventSafetyUnderageUsers": [
        ""
      ],
      "griefAbuseHarassmentProtection": "",
      "harassmentProtectionSteps": [
        ""
      ]
    }
  },
  "locations": {
    "developmentCountries": [
      "India"
    ],
    "deploymentCountries": [
      "India"
    ]
  }
}
