{
  "name": "Tupaia",
  "clearOwnership": {
    "isOwnershipExplicit": "Yes",
    "copyrightURL": "https://www.beyondessential.com.au/terms-and-conditions/"
  },
  "platformIndependence": {
    "mandatoryDepsCreateMoreRestrictions": "No",
    "isSoftwarePltIndependent": "",
    "pltIndependenceDesc": ""
  },
  "documentation": {
    "isDocumentationAvailable": "Yes",
    "documentationURL": [
      "https://github.com/beyondessential/tupaia"
    ]
  },
  "NonPII": {
    "collectsNonPII": "Yes",
    "checkNonPIIAccessMechanism": "Yes",
    "nonPIIAccessMechanism": "we have a RESTful API which is included in our open repo and we also allow export to XLS and JSON formats. Through the front-end, users are able to access raw data (with relevant permissions) via export to XLS (and in some cases to PDF)"
  },
  "privacy": {
    "isPrivacyCompliant": "Yes",
    "privacyComplianceList": [
      "Tupaia is compliant with the Australian Privacy Act (incorporating the Australian Privacy Principles) and whilst we are not obliged to comply with GDPR (and have not been formally audited on GDPR) we believe we are fully compliant including measures such as the right to be forgotten (which we enable easily with a 'delete my account' function through the front-end) and minimising data collection and access (e.g. for users, we collect only minimum required data for account verification and for data access, we support highly granular permissions limiting user access to only the data they need)"
    ],
    "adherenceSteps": [
      ""
    ]
  },
  "standards": {
    "supportStandards": "Yes",
    "standardsList": [
      "ICD10",
      "mSuppy universal codes server",
      "HL7 FHIR"
    ],
    "implementBestPractices": "Yes",
    "bestPracticesList": [
      "Our software development pipeline has been built around an agile methodology and includes all principles in the software development lifecycle and architectural design principles. Every software team has a full-time tester (our ratio is 3 devs to 1 tester) and we have a full-time data team comprised of 4 people responsible for data cleaning and quality. We also have test automation to help ensure data integrity with each new version release. We support CI/CD, every single PR is reviewed, we regularly undertake code refactoring and our entire repo is available open-source, along with version release notes which are published immediately. We use a microservices architecture and adhere to open principles, including for our APIs. We have also engaged external security audits and incorporated their recommendations into the system."
    ]
  },
  "doNoHarm": {
    "preventHarm": {
      "stepsToPreventHarm": "Yes",
      "additionalInfoMechanismProcessesPolicies": "We have a comprehensive Child Protection Policy and Fraud & Corruption Policy which have both been reviewed by our largest donor (DFAT) and both are attached. All our staff are required to undertake a police check and additional child protection steps (e.g. specific child protection reference check with previous employers). We do not allow photos of children to be collected through our app (where these are identified, they are immediately deleted). We have also achieved B Corp certification, which includes extensive auditing of areas including employment and environmental policies."
    },
    "dataPrivacySecurity": {
      "collectsPII": "No",
      "typesOfDataCollected": [
        ""
      ],
      "thirdPartyDataSharing": "No",
      "dataSharingCircumstances": [
        ""
      ],
      "ensurePrivacySecurity": "Yes",
      "privacySecurityDescription": ""
    },
    "inappropriateIllegalContent": {
      "collectStoreDistribute": "No",
      "type": "",
      "contentFilter": "",
      "policyGuidelinesDocumentationLink": "",
      "illegalContentDetection": "",
      "illegalContentDetectionMechanism": ""
    },
    "protectionFromHarassment": {
      "userInteraction": "No",
      "addressSafetySecurityUnderageUsers": "",
      "stepsAddressRiskPreventSafetyUnderageUsers": [
        ""
      ],
      "griefAbuseHarassmentProtection": "",
      "harassmentProtectionSteps": [
        ""
      ]
    }
  },
  "locations": {
    "developmentCountries": [
      "Australia",
      "New Zealand"
    ],
    "deploymentCountries": [
      "Fiji",
      "Tonga",
      "Samoa",
      "Nauru",
      "Palau"
    ]
  }
}
