	{
    "sdgs": {
        "sdg": [
            "SDG3: Good Health and Well-Being",
            "SDG10: Reduced Inequalities",
            "SDG17: Partnerships for the Goals"
        ],
        "relevance": "The specific targets would be:\r\n\r\nTarget 3.4: Reduce mortality from non-communicable diseases and promote mental health\r\nStudies show that victims of hate speech online may show low self-esteem; feel lonely or isolated, suffer from sleeping disorders, increased anxiety and feelings of fear and insecurity. (source: SELMA - Hacking Online Hate: Building an Evidence Base for Educators - 2019)\r\nGiven that we are a mental, social and emotional wellbeing solution, we are contributing to target 3.4 (reducing mortality from non-communicable diseases and promoting mental health). Even though the indicator is just Suicide rate, we offer preventive and accessible strategies to address the impact that hate speech has in victims and bystanders on their mental health which could lead to potential feelings associated with suicide and suicidal thoughts. We provide coping mechanisms to deal with a violent situation and also prevent it from happening in the future.\r\n\r\nTarget 10.2: Promote universal social, economic and political inclusion\r\nOur Chat Story as well as the relatable examples within the Interventions address different topic that minorities are exposed to with the intention of raising awareness and creating empathy to support them in the future. We care about inclusion, that is why our solution is created a modular story that can fit new audience struggles and examples. We will continue working to diversify the content and the excluded groups will be represented.\r\n\r\nTarget 17.6: Knowledge sharing and cooperation for access to science, technology and innovation\r\nTarget 17.17: Encourage effective partnerships\r\nWe work collectively summoning a co-creation committee composed by topic experts, psychologist, scriptwriters and youth, as well as expert organizations and international organizations such as Unicef. We encourage knowledge sharing by guiding the co.creation sessions focusing on each collaborator skills set and know how. Feedback is appreciated and encouraged and reviews of the content are constant. We have worked in the past with organizations such as the University of Oxford, the University of Brasilia, the Centre of Apperance Research to name a few. In this case, we have partnered with Weni and UNICEF Brazil is collaborating with dissemination, but we have actively worked with:\r\n\r\n- Clara Becker (Fundadora at Redes Cordiais): She founded Redes Cordiais, a media platform, with the intent of contributing to social distension, so that the democratic debate and interaction between different groups on social networks take place smoothly, without the pollution caused by the growth of hate and fake news.\r\n\r\n- Gabriela de Almeida Pereira (Content Developer at Redes Cordiais): Currently working as a Communications Analyst in UN Women. She graduated in Journalism, with a specialization in Management of Public Policies in Gender and Race. She is also a master's student in the Graduate Program in Human Rights and Citizenship.\r\n\r\n- Ellen de Paula (Executive Coordinator at Viração Educomunicação): Ellen de Paula is an actress and has a master's in Scenic Art. As an educator, researcher and cultural producer, she has over 10 years of experience working with cultural events and communication.\r\n\r\n- Monise Cristina (Communications Coordinator at Viração Educomunicação): Monise Cristina has a master's degree in History, and is a specialist in the History of Media and Politics in contemporary Brazil and an educommunicator, with more than 10 years of experience in communication and advertising.\r\n\r\n- Lorleen Farrugia (Digital Safety Expert & Researcher): Lorleen Farrugia has a PhD in Psychology and long-term experience in the field of child online safety. She is a researcher and consultant in online safety and child rights. She also lectures in social psychology, research methods and children, young people and media at the University of Malta.\r\n\r\n- Eduarda Carreira (Clinical Psychologist): Eduarda Carreira has a masters in neurosciences and is specialized in CBT, ACT and Sexology. She is an experienced clinical psychologist with a background in Neuropsychology, Psychological Assessment, Psychotherapy and Mindfulness.\r\n\r\n- Kelli Angelini (Lawyer - Online Safety Expert): Pioneer and active in the area of ​​digital law since 2002 and in education and digital awareness since 2014. Implementing Digital Education Programs in several public and private schools across Brazil.\r\n\r\n- Mariana Nunes (Ashoka Young Changemaker): Mariana joined the Brazilian Young Parliament, in which students help draft bills, and proposed that schools had to adopt mental health practices and therapies. She founded a network of volunteers to offer psychological support and lectures in schools, Autoestima-se. \r\n\r\n- Lívia Maria (Ashoka Young Changemaker): Lívia is a young activist leading educational projects such as Levanta Jovem. She is a part of Ashoka Young Changemakers and was the first young person from the north of Brazil to be recognized as a Global Teen Leader by the We Are Family Foundation.\r\n\r\n- Bia Pimentel (Youth Committee Member): Beatriz is a Museology Student at the Federal University of Minas Gerais, worked as a researcher for two years and now works in the field of cultural production.\r\n\r\n- Mariana Lima (Youth Committee Member): Mariana is a Journalism Student at the Federal University of Mato Grosso do Sul. She aims to bring the voice of youth to the co-creation process of the Online Hate Project. \r\n\r\n- Everton Behenck (Chat Story Scriptwriter): Writer, Creative and Marketing Director with 17 years of experience building value for the most important brands in Latin America.\r\n"
    },
    "sectors": [],
    "stage": "DPG",
    "openlicenses": [
        {
            "openLicense": "CC-BY-4.0",
            "openLicenseEvidenceURLs": "https://talk2u.co/open-content/online-hate"
        },
        {
            "openLicense": "CC-BY-NC-SA-4.0",
            "openLicenseEvidenceURLs": "https://talk2u.co/open-content/online-hate"
        },
        {
            "openLicense": "CC-BY-SA-4.0",
            "openLicenseEvidenceURLs": "https://talk2u.co/open-content/online-hate"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Talk2U LLC",
            "clearOwnershipURL": "https://talk2u.co/terms-of-use\r\n\r\nWe have individual contracts with co-creators including a CIIA (confidential information and inventions agreement). You can read a model of that document here: https://drive.google.com/file/d/19H7oGLoNLwncazRgA3bHaZMfSpsnMSlH/view?usp=sharing\r\n"
        }
    ],
    "documentation": "We use click up to work with our collaborators, and before they can join our community, we have an open content project charter, as well as contributors guidelines and code of conducts in place: https://doc.clickup.com/3119819/d/h/2z6pb-285/5f1edf74cf2bd0c\r\n\r\nAs well as a link to the CLAs: https://docs.google.com/forms/d/e/1FAIpQLSf5IANca1-78GCkoH5M_T6VLnmj2ci1YWweOzdLfsOhqpXFog/viewform\r\n",
    "NonPII": {
        "collectsNonPII": "No",
        "nonPIIAccessMechanism": ""
    },
    "dataPrivacySecurity": {
        "collectsPII": "PII data is NOT collected NOT stored and NOT distributed.",
        "typesOfPIIDataCollected": [],
        "dataPrivacySecurity": ""
    },
    "userContent": {
        "contentManagement": "Content is NOT collected NOT stored and NOT distributed.",
        "contentTypes": [],
        "contentManagementPolicy": ""
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "Contributors Code of Conduct: https://doc.clickup.com/3119819/p/h/2z6pb-185/8fc981df454a553\r\nAlso we have a Protocol to assess and respond to any claims and reports that we might receive from our community. We wrote the Community Conflict Resolution as follows:\r\n\r\nAs Community Leaders we are responsible for resolving conflicts that may happen within our community of contributors. This is a guideline on how to approach those unpleasant situations as quickly and effective as possible.\r\n\r\n\r\nEnforcement Ladder\r\n\r\nAs part of the Community Impact Guidelines we have set 4 different levels of consequences available to enforce. Logically, it would be a ladder in which the continuous misbehavior will lead to a level 4 consequence. However, some behaviors may apply directly to a level 4 depending on the gravity of the violation.\r\n\r\nThis is a guideline on what would be considered violations of the Code of Conduct and how these will be handled:\r\n\r\nLevel 1 - Correction\r\n\r\nCommunity Impact: Use of inappropriate language or other behavior deemed\r\nunprofessional or unwelcome in the community.\r\nConsequence: A private, written warning from community leaders, providing\r\nclarity around the nature of the violation and an explanation of why the\r\nbehavior was inappropriate. A public apology may be requested.\r\n\r\nLevel 2 - Warning\r\n\r\nCommunity Impact: A violation through a single incident or series of\r\nactions.\r\nConsequence: A warning with consequences for continued behavior. No\r\ninteraction with the people involved, including unsolicited interaction with\r\nthose enforcing the Code of Conduct, for a specified period of time. This\r\nincludes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.\r\n\r\nLevel 3 - Temporary Ban\r\n\r\nCommunity Impact: A serious violation of community standards, including\r\nsustained inappropriate behavior.\r\nConsequence: A temporary ban from any sort of interaction or public\r\ncommunication with the community for a specified period of time. No public or\r\nprivate interaction with the people involved, including unsolicited interaction\r\nwith those enforcing the Code of Conduct, is allowed during this period.\r\nViolating these terms may lead to a permanent ban.\r\n\r\nLevel 4 - Permanent Ban\r\n\r\nCommunity Impact: Demonstrating a pattern of violation of community\r\nstandards, including sustained inappropriate behavior, harassment of an\r\nindividual, or aggression toward or disparagement of classes of individuals.\r\nConsequence: A permanent ban from any sort of public interaction within the\r\ncommunity.\r\n\r\n\r\nReporting and Conflict resolution process\r\n\r\nThere are 2 ways to receive reports:\r\n\r\n               a. External Reports: A person from our contributors' community sends an email to\r\n               codeofconduct@talk2u.co \r\n               b. Internal Reports: A team member reports the incident via our private slack channel   \r\n               report-misconducts\r\n\r\nAll reports should include: \r\n\r\nA detailed description of what happened, where it happened and when it happened\r\nAny evidence of the misconduct to be reported (screenshots, audio, images, etc). Anything that will allow Community Leader to be quick and effective in the conflict resolution\r\nName of the rule breaker and, if you have it, contact information.\r\n\r\n\r\nTo follow up on reports, we will create and maintain a Code of Conduct Violations Report (CoCVR) document where we will be compiling all the reports of Code of Conduct violation to help us detect recurrent misbehaviors in consequence enforcement.\r\n\r\n\r\nResolution Process\r\n\r\nSTEP 1 - We receive a misconduct report and assign who will be the community leader that will address the report.\r\n                    \r\nSTEP 2 - We open the CoCVR and we add the information to the spreadsheet. We do a brief analysis and in case we need more information we connect with the reporter and specify what else would be useful for the conflict resolution.\r\n\r\nSTEP 3 - We assess the rule breaker Community status, to do so we take 2 things in consideration:\r\n                    a. Amount of violations they have committed to date within our Community: we search for \r\n                    the rule breaker's name in the CoCVR\r\n                    b. The gravity of the violation: [ADD EXAMPLES OF EXTREME/SERIOUS VIOLATIONS]\r\n\r\nSTEP 4 - We send a response within 72hs of receiving the report to the reporter of the incident informing the next steps to be taken based on the assessment.\r\n\r\nSTEP 5 - We engage with the rule breaker to inform that a report has been received and what has been our decision. This decision might include requesting for more information on their end to comprehend what happened, or it could directly be enforcing one of the levels of our enforcement ladder.\r\n\r\nSTEP 6 - If it is still visible within our Community, we edit, remove or modify the interaction that created the conflict. We might decide to leave it visible and make a public comment regarding our approach towards that behavior.\r\n\r\nAdditional Considerations:\r\n\r\nBi-monthly reports should be delivered to understand our community overall behavior\r\nConflict resolution time tracking should be a must to assess if we are complying with our SLA\r\n\r\nResponsible Community Leaders\r\n\r\nBruna Gelangauskas\r\nLu Suárez Battán\r\nNicolás Ferrario"
    },
    "locations": {
        "developmentCountries": [
            "Brazil",
            "Finland",
            "Spain",
            "Uruguay"
        ],
        "deploymentCountries": [
            "Brazil"
        ]
    },
    "deploymentOrganisations": [
        "United Nations International Children"
    ],
    "deploymentCountriesDepartments": [
        "Not yet",
        " but we are having conversations with a local government in Minas Gerais to do a pilot in 10 schools. We are also scotuing a lead in the ministry of human rights which has recently opened a new \"Hate speech Secretary\""
    ],
    "otherDeploymentOrganisations": [
        "General Public - Youth in Brazil"
    ],
    "awardsReceived": [
        "No",
        " it has been recently been launched for a pilot research to assess impact. Results will be published in the next few weeks."
    ],
    "id": "10447",
    "name": "Talk2U (mental wellbeing) - Hate Speech Module",
    "aliases": [
        "T2U",
        " Talk2U",
        " Talk2U Online Hate Journey",
        " Talk2U Como Se Eu Fosse"
    ],
    "categories": [
        "Open Content"
    ],
    "description": "Therapeutic chat conversations to develop socio-emotional skills that mitigate the impact of online hate specially targeted to victims and bystanders from 18 to 29 years old.",
    "website": "https://talk2u.co/journeys/online-hate",
    "repositories": [
        {
            "name": "main",
            "url": "https://talk2u.co/open-content/online-hate"
        }
    ],
    "openStandards": [
        "As Open Standards",
        " we use:\r\n1. PDF: for scripts",
        " license usage and research tools\r\n2. MP4: for videos that are part of the audiovisual assets\r\n3. JPG: for images that illustrated the strategies\r\n4. CSV: for training and testing sets\r\n5. .JSON: for platform flows"
    ],
    "bestPractices": [
        "Our co-creation process and experience development are inspired by:\r\n\r\n1. Principles for Digital Development\r\n\r\na. Design with the user: we create a youth committee to join our co-creation committee and to represent the voices of youth in our creations. We also go through 3 user testings before launching a pilot",
        " in this case",
        " we reached 144 users testers and 382 pilot participants.\r\n\r\nb. Understand the Existing Ecosystem: we had 11 interviews with experts on the youth and online safety to understand the context (8 of them from Brazil). When including users",
        " we also understood how if affected them in particular within Brazil.\r\n\r\nc. Design for scale: our interventions can be scaled up to any communities since they are hosted in mainstream chat platforms that allows to expand reach based on the penetration of cellphones. We are having conversation with telcos and government to expand our reach through their networks and with additional funding for dissemination after pilot results.\r\n\r\nd. Build for sustainability: our journeys are created based on our Mental Health Map",
        " which allows us to expand the content to multiple new interventions",
        " ensuring that users and stakeholders involved with be sure to receive ongoing support if engaged with the solution.\r\n\r\ne. Be Data Driven: no only our interventions are evidence-guides",
        " but we also run thorough testing and pilots to ensure long-lasting impact. Within the interventions we build in indicators to help us understand performance and acceptability of our target audience\r\n\r\nf. Use Open Data",
        " Open Content",
        " etc: for this project we have created 45 content documents",
        " as well as contributing with Open Data and collaborating with our tech partners for the development of Open Software. Our process also allows for Open Innovation partnering with multiple stakeholders.\r\n\r\ng. Reuse and Improve: being our first approach to Open Content",
        " we can say in this case we gave support to Weni",
        " our tech partners",
        " who have been building their Platform with the RapidPro Open community and have contributed with the Open component of the Power BI connector for the platform and dashboard creation.\r\n\r\nh. Address Privacy and Security: since 2020 we have been really focus on working under the premise of Privacy by Design. We have a data protection expert lawyer",
        " and for this project",
        " we hired a local lawyer to update us on the latest LGPD implementation in Brazil. All our projects within Weni are anonymized",
        " we have a data management plan in place",
        " and updated simple privacy policies that all of our users accept before entering the experiences.\r\n\r\ni. Be Collaborative: Not only are we sharing part of our heart with the Open Community",
        " but also as one of our core values",
        " we leverage on collective genius. We believe that the only way to create impact and keep innovating",
        " is by working together with different people",
        " with different backgrounds and skillsets. We also take time to teach to our co-creation committee",
        " what we do and how we do it to install capacities within our collaborators.\r\n\r\n\r\n2. Agile Development\r\n\r\nTo manage our projects we use an agile approach by working in cross-functional squads",
        " as well as incorporating external partners and co-creation collaborators. We divide our work into 2 week sprints",
        " and use ClickUp to follow up on advancements giving visibility to the rest of the team. We have 3 instances for User testings",
        " which creating the solutions",
        " we make them part of the process from the start",
        " and test quick prototypes with the scripts in all their versions.\r\n\r\n3. Human Centered Design Principles\r\na. Understand and Address the Core Problems: Besides desk research on the topic we are going to address",
        " we interview experts",
        " make focus groups and one on one interviews with our target audience",
        " and finish our work with a Behavioral Map that gives us context to start building the project. This process usually takes us around 3-4 months\r\n\r\nb. Be People-Centered: We don't build a solution if we don't interact with our target audience before. Also as we move forward with getting to know individualities",
        " we have created a modular way of developing interventions that allows us to personalize and keep on working on personalization for a long time. The vision we have is to be able to provide a bias-free experience where relatable examples help us connect with our audience quick and get them engaged in the development of their skills.\r\n\r\nc. Use an Activity-Centered Systems Approach: our projects are complex and involve multiple stakeholders. We have created a system based on the activities to be developed in order to reach the launch of our solution: Learn Phase",
        " Create Phase",
        " Test Phase and Impact Phase. We also are data driven and assess them impact of our solution working with control groups that can allow us to understand complex elements of the solution with an evidence based approach.\r\n\r\nd. Use Rapid Iterations of Prototyping and Testing: when we write the first script we make a quick prototype",
        " some of the have including in the past",
        " focus groups meetings for a script reading to get feeling and thoughts before building the tech solution. We also use a bot building tool that allows us to build a quick prototype and iterate as many times as needed with minimum effort. This platform also allows us to AB test."
    ],
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "Talk2U (mental wellbeing) - Hate Speech Module",
            "website": "https://talk2u.co/journeys/online-hate",
            "org_type": "owner",
            "contact_name": " Lucila Suarez Battan  ",
            "contact_email": "lu@talk2u.co"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "GDPR, LGPD",
            "privacyComplianceURL": "https://talk2u.co/privacy-policy/como-se-eu-fosse"
        }
    ]
}
