	{
    "sectors": [],
    "stage": "DPG",
    "documentation": "https://www.drupal.org/documentation\r\nhttps://api.drupal.org ",
    "openlicenses": [
        {
            "openLicense": "GPL-2.0",
            "openLicenseEvidenceURLs": "https://git.drupalcode.org/project/drupal/-/blob/10.1.x/core/LICENSE.txt\r\n\r\nhttps://www.drupal.org/about/licensing"
        },
        {
            "openLicense": "GPL-3.0",
            "openLicenseEvidenceURLs": "https://git.drupalcode.org/project/drupal/-/blob/10.1.x/core/LICENSE.txt\r\n\r\nhttps://www.drupal.org/about/licensing"
        }
    ],
    "sdgs": [
        {
            "sdg": "SDG8: Decent Work and Economic Growth",
            "relevance": "Drupal supports the Sustainable Development Goals in 2 parallel ways: \r\n\r\nDirect support, in which the Drupal project itself advances the goals. \r\nIndirect support, in which Drupal empowers other organizations to advance the SDGs. \r\n\r\nIn fact, https://sdgs.un.org/goals is a Drupal site! In addition, there are other already recognized Digital Public Goods, such as FarmOS(https://www.drupal.org/project/farm), that are built with Drupal as the foundation. \r\n\r\n===========\r\nDirect support:  \r\n===========\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\n\r\nTarget 8.2: Diversify, innovate and upgrade for economic productivity\r\nTarget 8.5: Full employment and decent work with equal pay\r\n\r\nBecause Drupal is an innovative and market leading software platform--that is open source and based on common technology standards--provides direct opportunities for economic empowerment. \r\n\r\nAs an open source project with robust multilingual support a global community of contributors, Drupal is available to anyone, without licensing fees, dramatically lowering the start-up cost of digital business for entrepreneurs around the world. \r\n\r\nFurthermore, Drupal jobs are tech jobs, not gate-kept traditional degrees or mandatory certifications, and can be done from anywhere in the world. \r\n\r\nAs an open source project, Drupal supports entrepreneurs who want to build a new business opportunity on the web. This is reflected in the nearly 1 million websites using Drupal today: https://www.drupal.org/project/usage/drupal \r\n\r\nOn the enterprise scale as well, analysts like Gartner and Forrester see significant economic opportunities in the use of open source softwares: https://www.forrester.com/blogs/what-open-sources-collision-with-paas-means-for-drupal-and-wordpress-services-forr-in-3-video/ \r\n\r\nThere is also an ecosystem of more than a thousand Drupal agencies hiring Drupal talent in nearly every country in the world, and tens of thousands of end-users who need the same talent. Because Drupal is a widely adopted technology in both the private and public sector, Drupal empowers those who learn it with more bargaining power and more opportunities for jobs in Open Source technology. Demand is high enough that the Drupal Association maintains jobs.drupal.org as a platform to connect talented Drupal developers to employment opportunities. \r\nhttps://www.drupal.org/drupal-services \r\nhttps://jobs.drupal.org\r\nhttps://www.indeed.com/jobs?q=Drupal+Developer&l=&vjk=c4545e0824ca3195 \r\n\r\nFinally communities all of the world have local associations that connect emerging Drupal talent with economic opportunities in their area: \r\nhttps://www.drupal.org/node/3069614 \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nTarget 10.1: Reduce income inequalities\r\nTarget 10.2: Promote universal social, economic and political inclusion\r\n\r\nOpen source software such as Drupal offers a counter-balance to traditional economic models that extract resources from developing nations rather than providing them resources. An internet based on proprietary technology, patents, and trademarks replicates the wealth extraction of private industry, and crowds out entrepreneurship. It puts the wealth and value in only a few hands.\r\n\r\nIn contrast Drupal and the open web focus on providing a free and open internet, where that economic opportunity is accessible to all. In particular, Drupal empowers low-income users around the globe in two key ways.\r\n\r\nEntrepreneurship - In the last two decades, entrepreneurs have built businesses based on Drupal all over the world, participating in an ecosystem of almost $4 billion of economic activity. Many of these entrepreneurs are economically disadvantaged and underprivileged regions of the world. \r\n\r\n\r\nEvidence: Geographical Drupal groups: https://groups.drupal.org/og/all?keys=>_tid[]=141\r\n\r\nEvidence: The Drupal Association just hosted a Young Africa Leaders Initiative fellow - https://www.drupal.org/association/blog/drupal-association-selected-to-host-denaya-dennis-a-young-african-leader \r\n\r\nSocial, economic, and political inclusion: The open web can be a powerful equalizer. In contrast to the increasingly proprietary platforms dominating web publishing, Drupal can be used by anyway to promote a social message or political point of view. \r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nTarget 17.6: Knowledge sharing and cooperation for access to science, technology and innovation\r\nTarget 17.7: Promote sustainable technologies to developing countries\r\nTarget 17.8: Strengthen the science, technology and innovation capacity for least-developed countries\r\nTarget 17.16: Enhance the global partnership for sustainable development\r\nTarget 17.17: Encourage effective partnerships\r\nTarget 17.18: Enhance availability of reliable data\r\n\r\nDrupal's support of goal 17 is best exemplified by the next section, \"Indirect Support\", in which we discuss the hundreds or even thousands of mission driven organizations and government agencies that have chosen Drupal to advance their goals and the SDGs. \r\n\r\nDrupal is often the hub of the digital presence of all of these organizations- allowing them to promote, monitor, and report on their progress in advancing the SDGs. \r\n\r\nThe United Nations itself uses Drupal to publish, promote, and coordinate the SDGs- helping to grow the international partnership: \r\nhttps://sdgs.un.org/topics/technology\r\nhttps://sdgs.un.org/topics/multi-stakeholder-partnerships-and-voluntary-commitments\r\nhttps://partnershipaccelerator.netlify.app/\r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n(See specific case studies below)\r\n\r\n\r\n\r\n\r\n======================\r\nIndirect support: \r\nAnd evidence for 17: Partnerships for the Goals\r\n======================\r\n\r\nThere are hundreds of organizations using Drupal to further their missions and advance the SDGs. Examples of organizations using Drupal to support each one of the SDGs is included below. The links to evidence link directly to the Drupal sites supporting each. \r\n\r\nThere are many more examples of each category that could be provided as additional support. \r\n\r\nSee Drupal Nonprofit List here\r\n\r\n===========\r\n1: End Poverty in all its forms everywhere\t\r\n===========\r\n\r\nEvidence: Even post-2015 the Millennium Campaign works to promote the MDGs, underlining their impact and that they continue to be a sound and worthwhile investment for all in the fight against global poverty.\r\nLink to Evidence: https://www.endpoverty2015.org/\r\n\r\nEvidence: For 40 years and in more than 40 countries, Mercy Corps has helped communities forge new paths to prosperity in the face of disaster, poverty, and the impacts of climate change. \r\nLink to Evidence: https://www.mercycorps.org/ \r\n\r\nEvidence: The Elder Index is a measure of the income that older adults need to meet their basic needs and age in place with dignity.\r\nLink to Evidence: https://elderindex.org/about\r\n\r\n===========\r\n2: Zero Hunger\r\n===========\r\n\r\nEvidence: UNICEF works to prevent all forms of malnutrition by improving children’s and women’s access to nutritious, safe, affordable and sustainable diets. We support quality nutrition, health, water and sanitation, and social protection services that keep children well nourished. We also promote optimal feeding, hygiene and care practices for children and women.Where prevention falls short, UNICEF prioritizes the early detection, treatment and care of malnourished children to help them survive, recover, and go on to live healthy and productive lives. Through nutrition programmes in 130 countries, we seek to reach children, adolescents and women everywhere – at key moments in life.\r\nLink to Evidence: https://www.unicef.org/nutrition\r\n\r\n===========\r\n3: Good Health and Well-Being\r\n===========\r\n\r\nEvidence: Doctors Without Borders/Médecins Sans Frontières (MSF) cares for people affected by conflict, disease outbreaks, natural and human-made disasters, and exclusion from health care in more than 70 countries.\r\nLink to Evidence: https://www.doctorswithoutborders.org/\r\n\r\nEvidence: The CDC's National Prevention Information Network was the central portal for managing the COVID-19 response in the United States.\r\nLink to Evidence: https://npin.cdc.gov/ \r\n\r\nEvidence: The Infant and Young Child Feeding (IYCF) Image Bank is a collection of over 900 images, developed from adaptations of UNICEF’s Community Infant and Young Child Feeding Counselling Package; these, and other similar images about recommended IYCF practices, have been used in more than 70 countries for counseling and training to promote behavior change for improved maternal and child nutrition.\r\nLink to Evidence: https://iycf.advancingnutrition.org\r\n\r\nEvidence: The TB DIAH Data Hub is part of the United States Agency for International Development's performance-based measures to end TB—the Global Accelerator to End Tuberculosis—and contains data and information for decision-making.\r\nLink to Evidence: https://hub.tbdiah.org\r\n\r\nEvidence: The Delta Center for a Thriving Safety Net brings together primary care associations and behavioral health state associations to advance policy and practice change; our ultimate goal is to cultivate health policy and a care system that is more equitable and better meets the needs of individuals and families. \r\nLink to Evidence: https://deltacenter.jsi.com\r\n\r\nEvidence: The goal of the High Performing Health Care System tool is to provide information about the functionality of health systems processes, functions, and intermediate outcomes.\r\nLink to Evidence: https://hphctool.org\r\n\r\nEvidence: The goal of the Child Health Task Force is to strengthen equitable and comprehensive child health programs - focused on children aged 0-19 years in line with Global Strategy for Women’s, Children’s and Adolescents' Health (2016-2030) - through primary health care, inclusive of community health systems.\r\nLink to Evidence: https://www.childhealthtaskforce.org\r\n\r\nEvidence: The Reproductive Health National Training Center (RHNTC) is your go-to source for family planning and adolescent health training and technical assistance.\r\nLink to Evidence: https://rhntc.org\r\n\r\nEvidence: STOP Spillover works with in-country stakeholders to understand and address the threats posed by zoonotic viral diseases and reduce the risk of viral spillover and spread.\r\nLink to Evidence: https://stopspillover.org\r\n\r\nEvidence: USAID Advancing Nutrition envisions a world where countries, communities, and families are well nourished, resilient, and able to thrive.\r\nLink to Evidence: https://www.advancingnutrition.org\r\n\r\nEvidence: The Country Health Information Systems and Data Use project (CHISU) strengthens country capacity, leadership, and self-reliance to manage and use high-quality health information systems to improve evidence-based decision-making.\r\nLink to Evidence: https://chisuprogram.org\r\n\r\nEvidence: The Information Mobilized for Performance Analysis and Continuous Transformation (IMPACT) Team approach is a structured supply chain problem solving and action planning approach; the IMPACT Team Portal is a hub for training these teams and measuring their performance in Kenya, Mozambique, Sierra Leone, and Tanzania.\r\nLink to Evidence: https://scdatause.org\r\n\r\nEvidence: The USAID COVID-19 Technical Assistance Implementing Partners Forum is a platform for bi-directional sharing of updates, experiences, and ideas to increase the potential effectiveness of USAID’s COVID-19 investments.\r\nLink to Evidence: https://covidvaccineipforum.jsi.com\r\n\r\nEvidence: The Strengthening Systems of Care for People with HIV and Opioid Use Disorder Project provides coordinated technical assistance (in nine states) across HIV and behavioral health/substance use to ensure that people with HIV and OUD have access to care, treatment, and recovery services that are client-centered and culturally responsive.\r\nLink to Evidence: https://ssc.jsi.com\r\n\r\nEvidence: The Access Collaborative dashboard houses data and information on policies related to the roll-out of DMPA-SC (an injectable contraceptive) in 20 countries.\r\nLink to Evidence: https://dashboard.access-collaborative.com\r\n\r\nEvidence: Advancing Partners & Communities (APC) advances and supports community programs that seek to improve the overall health of communities and achieve other health-related impacts, especially in relationship to family planning.\r\nLink to Evidence: https://www.advancingpartners.org\r\n\r\nEvidence: The Strengthening Partnerships, Results, and Innovations in Nutrition Globally project (SPRING) was dedicated to strengthening global and country efforts to scale up high-impact nutrition practices and policies; SPRING provided state-of-the-art technical support focused on preventing stunting and maternal and child anemia in the first 1,000 days, linking agriculture and nutrition, and creating social and behavior change through communication.\r\nLink to Evidence: https://www.spring-nutrition.org\r\n\r\nEvidence: farmOS (built with Drupal) is used to track lab results that test food quality and compare against soil health practices.\r\nLink to Evidence: https://proofingfuture.eu/2022/02/09/bionutrient-food-association/\r\n\r\n===========\r\n4: Quality Education\r\n===========\r\nTarget 4.3: Equal access to affordable technical, vocational and higher education\r\nTarget 4.4: Increase the number of people with relevant skills for financial success\r\n\r\nDrupal as an open source project allows self-service technical education that is practically focused on highly relevent technical skills that will server people well in their technical careers.\r\n\r\nIn addition Drupal Association is a US-based 501c3 non-profit organization serving a global community. A core part of the Drupal Association and Drupal project's mission is to provide technology education at both in-person and online events. It is our belief that non-traditional education in technology skills is a tool for economic empowerment, and levels the playing field of earning opportunities for people across the globe. \r\n\r\nThe Drupal project and Association do this in a variety of ways: \r\nEducational sessions and content at DrupalCon: \r\nhttps://www.drupal.org/association/drupalcon/locations \r\n\r\nA contribution mentorship program: \r\nhttps://www.drupal.org/community/contributor-guide/contribution-areas/mentor\r\n\r\nThe Discover Drupal program, an educational and career development program designed to uplift members of marginalized communities:  \r\nhttps://www.drupal.org/association/discover-drupal \r\n\r\nFostering a global community of educators offering contribution mentorship and training: \r\nhttps://www.drupal.org/community/events \r\n\r\nAnd a network of training partners:\r\nhttps://www.drupal.org/training  \r\n\t\r\nEvidence: “71% of the top 100 universities use Drupal” (in image on page)\r\nLink to Evidence: https://www.drupal.org/industries/education\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Makerere University\r\nLink to Evidence: https://www.mak.ac.ug\r\n\r\nEvidence: University of Maryland\r\nLink to Evidence: https://umd.edu\r\n\r\nEvidence: University of New Hampshire\r\nLink to Evidence: https://www.unh.edu\r\n\r\n(this could be hundreds of examples)\r\n\r\n===========\r\n5: Gender Equity\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: UN Women\r\nLink to Evidence: https://www.unwomen.org/en\r\n\r\nEvidence: USAID (Gender Equality and Women’s Empowerment one of many areas of focus)\r\nLink to Evidence: https://www.usaid.gov/what-we-do/gender-equality-and-womens-empowerment\r\n\r\n===========\r\n6: Clean Water and Sanitation\r\n===========\r\n\r\nEvidence: A farmOS Produce Safety module was developed by the University of Vermont, which includes recordkeeping for on-farm water quality testing and worker hygiene requirements (farmOS is built with Drupal).\r\nLink to Evidence: https://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\nEvidence: Drop in the Bucket \r\nLink to Evidence: https://dropinthebucket.org/ \t\r\n\r\n===========\r\n7: Affordable and Clean Energy\r\n===========\r\n\r\nEvidence: Solar Energy West Africa \r\nLink to Evidence: http://solar-afrika.de/\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Labor Community Strategy Center \r\nLink to Evidence: https://thestrategycenter.org/\r\n\r\nEvidence: Institute on Work and Health \r\nLink to Evidence: https://www.iwh.on.ca/ \r\n\r\n===========\r\n9: Industry, Innovation and Infrastructure\r\n===========\r\nTarget 9.C: Universal access to information and communications technology\r\n\r\nIn combination with other software components that makeup an Open Web, Drupal provides an open, free, and not-centrally controlled publishing platform that is part of making a free and open internet infrastructure. \r\n\r\nWhile this target is primarily focused on the *access* side of the innovation and infrastructure equation; that is, do people have affordable access to mobile networks and the internet - we fundamentally believe that this is not complete without also having access and control to *publish* their own words on these networks. \r\n\r\nThe Drupal project is philosophically aligned with the principles of the 'Open Web' - and in particular provides a web publishing platform that is not dependent on a centrally managed proprietary or government platform. By using Drupal, for free, individuals and organizations in any part of the world can own their platform and publish their content on the web freely. \r\n\r\nUsage of Drupal for more direct infrastructure innovation: \r\n\t\r\nEvidence: farmOS (built in Drupal) provides record keeping and planning tools for farmers to monitor their operations.\r\nLink to Evidence: https://opensensing.com/open-source-agtech-iot-ecosystem/\r\n\r\nEvidence: Technology for Agriculture \r\nLink to Evidence: https://www.fao.org/teca/\r\n\r\nEvidence: Global Center for Technology in parliament \r\nLink to Evidence: https://www.ictparliament.org/ \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nEvidence: Center for Reproductive rights \r\nLink to Evidence: https://reproductiverights.org/\r\n\r\nEvidence: Enough Project \r\nLink to Evidence: https://enoughproject.org/\r\n\r\nEvidence: Amnesty International \r\nLink to Evidence: https://www.amnesty.org/en/\r\n\r\nEvidence: Crea \r\nLink to Evidence: https://creaworld.org/ \r\n\r\n===========\r\n11: Sustainable Cities and Communities\r\n===========\r\n\r\nEvidence: GreenPeace UK \r\nLink to Evidence: https://www.greenpeace.org.uk/\r\n\r\nEvidence: National Environmental Education Week \r\nLink to Evidence: https://www.neefusa.org/education/eeweek\r\n\r\nEvidence: My Green Space \r\nLink to Evidence: https://www.mygreenspace.net/ \r\n\r\n===========\r\n12: Responsible Consumption and Production\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) can be used for traceability, tracking food production from seed to sale.\r\nLink to Evidence: http://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\n===========\r\n13: Climate Action\r\n===========\r\n\r\nDrupal is used by 10% of the top 10,000 sites on the web, and 3% of the top 1 million. (https://trends.builtwith.com/cms/Drupal)  By total traffic served rather than raw count the share may be even higher. 1 in roughly every 35 websites a user visits is likely to be a Drupal site. This means that optimizing the energy usage of the Drupal software has a significant impact on carbon emissions for major web properties all over the world. \r\n\r\nThe Drupal project is committed to evaluating the environmental impact and sustainability of it's software, and is partnering with major organizations such as Google to help improve the performance and thus carbon footprint of the web. \r\nhttps://www.drupal.org/about/sustainability \r\nhttps://www.youtube.com/watch?v=o7RgDIx8_90 \r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) is being used to measure on farm carbon capture.\r\nLink to Evidence: https://www.dell.com/en-us/perspectives/keeping-cows-happy-and-soil-healthy-with-ai-and-open-source-data-management/\r\n\r\n===========\r\n14: Life Below Water\r\n===========\r\nEvidence: Marine Ecosystem-Based Management \r\nLink to Evidence: http://webservices.itcs.umich.edu/drupal/mebm/\r\n\r\nEvidence: International Rivers \r\nLink to Evidence: https://www.internationalrivers.org/\r\n\r\nEvidence: Coral Reef Alliance \r\nLink to Evidence: https://coral.org/en/ \r\n\r\n===========\r\n15: Life on Land\r\n===========\r\nEvidence: The Climate Group  \r\nLink to Evidence: https://www.theclimategroup.org/\r\n\r\nEvidence: Rainforest Alliance   \r\nLink to Evidence: https://www.rainforest-alliance.org/ \r\n\r\n===========\r\n16: Peace, Justice and Strong Institutions\r\n===========\r\nEvidence: United Nations website\r\nLink to Evidence: https://www.un.org/en\r\n\r\nEvidence: LocalGov Drupal is a publicly owned asset that delivers a better digital experience for citizens, improves service outcomes, and saves money\r\nLink to Evidence: https://localgovdrupal.org/\r\n\r\nEvidence: The Drupal4Gov community is a non-profit organization dedicated to promoting the use of Drupal and other open source technologies in government institutions: \r\nLink to Evidence: https://drupal4gov.us \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nEvidence: Ashoka.org \r\nLink to Evidence: https://www.ashoka.org/en-us \r\n\r\nEvidence: The Sustainable Development Goals website\r\nLink to Evidence: https://sdgs.un.org/goals"
        },
        {
            "sdg": "SDG10: Reduced Inequalities",
            "relevance": "Drupal supports the Sustainable Development Goals in 2 parallel ways: \r\n\r\nDirect support, in which the Drupal project itself advances the goals. \r\nIndirect support, in which Drupal empowers other organizations to advance the SDGs. \r\n\r\nIn fact, https://sdgs.un.org/goals is a Drupal site! In addition, there are other already recognized Digital Public Goods, such as FarmOS(https://www.drupal.org/project/farm), that are built with Drupal as the foundation. \r\n\r\n===========\r\nDirect support:  \r\n===========\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\n\r\nTarget 8.2: Diversify, innovate and upgrade for economic productivity\r\nTarget 8.5: Full employment and decent work with equal pay\r\n\r\nBecause Drupal is an innovative and market leading software platform--that is open source and based on common technology standards--provides direct opportunities for economic empowerment. \r\n\r\nAs an open source project with robust multilingual support a global community of contributors, Drupal is available to anyone, without licensing fees, dramatically lowering the start-up cost of digital business for entrepreneurs around the world. \r\n\r\nFurthermore, Drupal jobs are tech jobs, not gate-kept traditional degrees or mandatory certifications, and can be done from anywhere in the world. \r\n\r\nAs an open source project, Drupal supports entrepreneurs who want to build a new business opportunity on the web. This is reflected in the nearly 1 million websites using Drupal today: https://www.drupal.org/project/usage/drupal \r\n\r\nOn the enterprise scale as well, analysts like Gartner and Forrester see significant economic opportunities in the use of open source softwares: https://www.forrester.com/blogs/what-open-sources-collision-with-paas-means-for-drupal-and-wordpress-services-forr-in-3-video/ \r\n\r\nThere is also an ecosystem of more than a thousand Drupal agencies hiring Drupal talent in nearly every country in the world, and tens of thousands of end-users who need the same talent. Because Drupal is a widely adopted technology in both the private and public sector, Drupal empowers those who learn it with more bargaining power and more opportunities for jobs in Open Source technology. Demand is high enough that the Drupal Association maintains jobs.drupal.org as a platform to connect talented Drupal developers to employment opportunities. \r\nhttps://www.drupal.org/drupal-services \r\nhttps://jobs.drupal.org\r\nhttps://www.indeed.com/jobs?q=Drupal+Developer&l=&vjk=c4545e0824ca3195 \r\n\r\nFinally communities all of the world have local associations that connect emerging Drupal talent with economic opportunities in their area: \r\nhttps://www.drupal.org/node/3069614 \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nTarget 10.1: Reduce income inequalities\r\nTarget 10.2: Promote universal social, economic and political inclusion\r\n\r\nOpen source software such as Drupal offers a counter-balance to traditional economic models that extract resources from developing nations rather than providing them resources. An internet based on proprietary technology, patents, and trademarks replicates the wealth extraction of private industry, and crowds out entrepreneurship. It puts the wealth and value in only a few hands.\r\n\r\nIn contrast Drupal and the open web focus on providing a free and open internet, where that economic opportunity is accessible to all. In particular, Drupal empowers low-income users around the globe in two key ways.\r\n\r\nEntrepreneurship - In the last two decades, entrepreneurs have built businesses based on Drupal all over the world, participating in an ecosystem of almost $4 billion of economic activity. Many of these entrepreneurs are economically disadvantaged and underprivileged regions of the world. \r\n\r\n\r\nEvidence: Geographical Drupal groups: https://groups.drupal.org/og/all?keys=>_tid[]=141\r\n\r\nEvidence: The Drupal Association just hosted a Young Africa Leaders Initiative fellow - https://www.drupal.org/association/blog/drupal-association-selected-to-host-denaya-dennis-a-young-african-leader \r\n\r\nSocial, economic, and political inclusion: The open web can be a powerful equalizer. In contrast to the increasingly proprietary platforms dominating web publishing, Drupal can be used by anyway to promote a social message or political point of view. \r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nTarget 17.6: Knowledge sharing and cooperation for access to science, technology and innovation\r\nTarget 17.7: Promote sustainable technologies to developing countries\r\nTarget 17.8: Strengthen the science, technology and innovation capacity for least-developed countries\r\nTarget 17.16: Enhance the global partnership for sustainable development\r\nTarget 17.17: Encourage effective partnerships\r\nTarget 17.18: Enhance availability of reliable data\r\n\r\nDrupal's support of goal 17 is best exemplified by the next section, \"Indirect Support\", in which we discuss the hundreds or even thousands of mission driven organizations and government agencies that have chosen Drupal to advance their goals and the SDGs. \r\n\r\nDrupal is often the hub of the digital presence of all of these organizations- allowing them to promote, monitor, and report on their progress in advancing the SDGs. \r\n\r\nThe United Nations itself uses Drupal to publish, promote, and coordinate the SDGs- helping to grow the international partnership: \r\nhttps://sdgs.un.org/topics/technology\r\nhttps://sdgs.un.org/topics/multi-stakeholder-partnerships-and-voluntary-commitments\r\nhttps://partnershipaccelerator.netlify.app/\r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n(See specific case studies below)\r\n\r\n\r\n\r\n\r\n======================\r\nIndirect support: \r\nAnd evidence for 17: Partnerships for the Goals\r\n======================\r\n\r\nThere are hundreds of organizations using Drupal to further their missions and advance the SDGs. Examples of organizations using Drupal to support each one of the SDGs is included below. The links to evidence link directly to the Drupal sites supporting each. \r\n\r\nThere are many more examples of each category that could be provided as additional support. \r\n\r\nSee Drupal Nonprofit List here\r\n\r\n===========\r\n1: End Poverty in all its forms everywhere\t\r\n===========\r\n\r\nEvidence: Even post-2015 the Millennium Campaign works to promote the MDGs, underlining their impact and that they continue to be a sound and worthwhile investment for all in the fight against global poverty.\r\nLink to Evidence: https://www.endpoverty2015.org/\r\n\r\nEvidence: For 40 years and in more than 40 countries, Mercy Corps has helped communities forge new paths to prosperity in the face of disaster, poverty, and the impacts of climate change. \r\nLink to Evidence: https://www.mercycorps.org/ \r\n\r\nEvidence: The Elder Index is a measure of the income that older adults need to meet their basic needs and age in place with dignity.\r\nLink to Evidence: https://elderindex.org/about\r\n\r\n===========\r\n2: Zero Hunger\r\n===========\r\n\r\nEvidence: UNICEF works to prevent all forms of malnutrition by improving children’s and women’s access to nutritious, safe, affordable and sustainable diets. We support quality nutrition, health, water and sanitation, and social protection services that keep children well nourished. We also promote optimal feeding, hygiene and care practices for children and women.Where prevention falls short, UNICEF prioritizes the early detection, treatment and care of malnourished children to help them survive, recover, and go on to live healthy and productive lives. Through nutrition programmes in 130 countries, we seek to reach children, adolescents and women everywhere – at key moments in life.\r\nLink to Evidence: https://www.unicef.org/nutrition\r\n\r\n===========\r\n3: Good Health and Well-Being\r\n===========\r\n\r\nEvidence: Doctors Without Borders/Médecins Sans Frontières (MSF) cares for people affected by conflict, disease outbreaks, natural and human-made disasters, and exclusion from health care in more than 70 countries.\r\nLink to Evidence: https://www.doctorswithoutborders.org/\r\n\r\nEvidence: The CDC's National Prevention Information Network was the central portal for managing the COVID-19 response in the United States.\r\nLink to Evidence: https://npin.cdc.gov/ \r\n\r\nEvidence: The Infant and Young Child Feeding (IYCF) Image Bank is a collection of over 900 images, developed from adaptations of UNICEF’s Community Infant and Young Child Feeding Counselling Package; these, and other similar images about recommended IYCF practices, have been used in more than 70 countries for counseling and training to promote behavior change for improved maternal and child nutrition.\r\nLink to Evidence: https://iycf.advancingnutrition.org\r\n\r\nEvidence: The TB DIAH Data Hub is part of the United States Agency for International Development's performance-based measures to end TB—the Global Accelerator to End Tuberculosis—and contains data and information for decision-making.\r\nLink to Evidence: https://hub.tbdiah.org\r\n\r\nEvidence: The Delta Center for a Thriving Safety Net brings together primary care associations and behavioral health state associations to advance policy and practice change; our ultimate goal is to cultivate health policy and a care system that is more equitable and better meets the needs of individuals and families. \r\nLink to Evidence: https://deltacenter.jsi.com\r\n\r\nEvidence: The goal of the High Performing Health Care System tool is to provide information about the functionality of health systems processes, functions, and intermediate outcomes.\r\nLink to Evidence: https://hphctool.org\r\n\r\nEvidence: The goal of the Child Health Task Force is to strengthen equitable and comprehensive child health programs - focused on children aged 0-19 years in line with Global Strategy for Women’s, Children’s and Adolescents' Health (2016-2030) - through primary health care, inclusive of community health systems.\r\nLink to Evidence: https://www.childhealthtaskforce.org\r\n\r\nEvidence: The Reproductive Health National Training Center (RHNTC) is your go-to source for family planning and adolescent health training and technical assistance.\r\nLink to Evidence: https://rhntc.org\r\n\r\nEvidence: STOP Spillover works with in-country stakeholders to understand and address the threats posed by zoonotic viral diseases and reduce the risk of viral spillover and spread.\r\nLink to Evidence: https://stopspillover.org\r\n\r\nEvidence: USAID Advancing Nutrition envisions a world where countries, communities, and families are well nourished, resilient, and able to thrive.\r\nLink to Evidence: https://www.advancingnutrition.org\r\n\r\nEvidence: The Country Health Information Systems and Data Use project (CHISU) strengthens country capacity, leadership, and self-reliance to manage and use high-quality health information systems to improve evidence-based decision-making.\r\nLink to Evidence: https://chisuprogram.org\r\n\r\nEvidence: The Information Mobilized for Performance Analysis and Continuous Transformation (IMPACT) Team approach is a structured supply chain problem solving and action planning approach; the IMPACT Team Portal is a hub for training these teams and measuring their performance in Kenya, Mozambique, Sierra Leone, and Tanzania.\r\nLink to Evidence: https://scdatause.org\r\n\r\nEvidence: The USAID COVID-19 Technical Assistance Implementing Partners Forum is a platform for bi-directional sharing of updates, experiences, and ideas to increase the potential effectiveness of USAID’s COVID-19 investments.\r\nLink to Evidence: https://covidvaccineipforum.jsi.com\r\n\r\nEvidence: The Strengthening Systems of Care for People with HIV and Opioid Use Disorder Project provides coordinated technical assistance (in nine states) across HIV and behavioral health/substance use to ensure that people with HIV and OUD have access to care, treatment, and recovery services that are client-centered and culturally responsive.\r\nLink to Evidence: https://ssc.jsi.com\r\n\r\nEvidence: The Access Collaborative dashboard houses data and information on policies related to the roll-out of DMPA-SC (an injectable contraceptive) in 20 countries.\r\nLink to Evidence: https://dashboard.access-collaborative.com\r\n\r\nEvidence: Advancing Partners & Communities (APC) advances and supports community programs that seek to improve the overall health of communities and achieve other health-related impacts, especially in relationship to family planning.\r\nLink to Evidence: https://www.advancingpartners.org\r\n\r\nEvidence: The Strengthening Partnerships, Results, and Innovations in Nutrition Globally project (SPRING) was dedicated to strengthening global and country efforts to scale up high-impact nutrition practices and policies; SPRING provided state-of-the-art technical support focused on preventing stunting and maternal and child anemia in the first 1,000 days, linking agriculture and nutrition, and creating social and behavior change through communication.\r\nLink to Evidence: https://www.spring-nutrition.org\r\n\r\nEvidence: farmOS (built with Drupal) is used to track lab results that test food quality and compare against soil health practices.\r\nLink to Evidence: https://proofingfuture.eu/2022/02/09/bionutrient-food-association/\r\n\r\n===========\r\n4: Quality Education\r\n===========\r\nTarget 4.3: Equal access to affordable technical, vocational and higher education\r\nTarget 4.4: Increase the number of people with relevant skills for financial success\r\n\r\nDrupal as an open source project allows self-service technical education that is practically focused on highly relevent technical skills that will server people well in their technical careers.\r\n\r\nIn addition Drupal Association is a US-based 501c3 non-profit organization serving a global community. A core part of the Drupal Association and Drupal project's mission is to provide technology education at both in-person and online events. It is our belief that non-traditional education in technology skills is a tool for economic empowerment, and levels the playing field of earning opportunities for people across the globe. \r\n\r\nThe Drupal project and Association do this in a variety of ways: \r\nEducational sessions and content at DrupalCon: \r\nhttps://www.drupal.org/association/drupalcon/locations \r\n\r\nA contribution mentorship program: \r\nhttps://www.drupal.org/community/contributor-guide/contribution-areas/mentor\r\n\r\nThe Discover Drupal program, an educational and career development program designed to uplift members of marginalized communities:  \r\nhttps://www.drupal.org/association/discover-drupal \r\n\r\nFostering a global community of educators offering contribution mentorship and training: \r\nhttps://www.drupal.org/community/events \r\n\r\nAnd a network of training partners:\r\nhttps://www.drupal.org/training  \r\n\t\r\nEvidence: “71% of the top 100 universities use Drupal” (in image on page)\r\nLink to Evidence: https://www.drupal.org/industries/education\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Makerere University\r\nLink to Evidence: https://www.mak.ac.ug\r\n\r\nEvidence: University of Maryland\r\nLink to Evidence: https://umd.edu\r\n\r\nEvidence: University of New Hampshire\r\nLink to Evidence: https://www.unh.edu\r\n\r\n(this could be hundreds of examples)\r\n\r\n===========\r\n5: Gender Equity\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: UN Women\r\nLink to Evidence: https://www.unwomen.org/en\r\n\r\nEvidence: USAID (Gender Equality and Women’s Empowerment one of many areas of focus)\r\nLink to Evidence: https://www.usaid.gov/what-we-do/gender-equality-and-womens-empowerment\r\n\r\n===========\r\n6: Clean Water and Sanitation\r\n===========\r\n\r\nEvidence: A farmOS Produce Safety module was developed by the University of Vermont, which includes recordkeeping for on-farm water quality testing and worker hygiene requirements (farmOS is built with Drupal).\r\nLink to Evidence: https://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\nEvidence: Drop in the Bucket \r\nLink to Evidence: https://dropinthebucket.org/ \t\r\n\r\n===========\r\n7: Affordable and Clean Energy\r\n===========\r\n\r\nEvidence: Solar Energy West Africa \r\nLink to Evidence: http://solar-afrika.de/\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Labor Community Strategy Center \r\nLink to Evidence: https://thestrategycenter.org/\r\n\r\nEvidence: Institute on Work and Health \r\nLink to Evidence: https://www.iwh.on.ca/ \r\n\r\n===========\r\n9: Industry, Innovation and Infrastructure\r\n===========\r\nTarget 9.C: Universal access to information and communications technology\r\n\r\nIn combination with other software components that makeup an Open Web, Drupal provides an open, free, and not-centrally controlled publishing platform that is part of making a free and open internet infrastructure. \r\n\r\nWhile this target is primarily focused on the *access* side of the innovation and infrastructure equation; that is, do people have affordable access to mobile networks and the internet - we fundamentally believe that this is not complete without also having access and control to *publish* their own words on these networks. \r\n\r\nThe Drupal project is philosophically aligned with the principles of the 'Open Web' - and in particular provides a web publishing platform that is not dependent on a centrally managed proprietary or government platform. By using Drupal, for free, individuals and organizations in any part of the world can own their platform and publish their content on the web freely. \r\n\r\nUsage of Drupal for more direct infrastructure innovation: \r\n\t\r\nEvidence: farmOS (built in Drupal) provides record keeping and planning tools for farmers to monitor their operations.\r\nLink to Evidence: https://opensensing.com/open-source-agtech-iot-ecosystem/\r\n\r\nEvidence: Technology for Agriculture \r\nLink to Evidence: https://www.fao.org/teca/\r\n\r\nEvidence: Global Center for Technology in parliament \r\nLink to Evidence: https://www.ictparliament.org/ \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nEvidence: Center for Reproductive rights \r\nLink to Evidence: https://reproductiverights.org/\r\n\r\nEvidence: Enough Project \r\nLink to Evidence: https://enoughproject.org/\r\n\r\nEvidence: Amnesty International \r\nLink to Evidence: https://www.amnesty.org/en/\r\n\r\nEvidence: Crea \r\nLink to Evidence: https://creaworld.org/ \r\n\r\n===========\r\n11: Sustainable Cities and Communities\r\n===========\r\n\r\nEvidence: GreenPeace UK \r\nLink to Evidence: https://www.greenpeace.org.uk/\r\n\r\nEvidence: National Environmental Education Week \r\nLink to Evidence: https://www.neefusa.org/education/eeweek\r\n\r\nEvidence: My Green Space \r\nLink to Evidence: https://www.mygreenspace.net/ \r\n\r\n===========\r\n12: Responsible Consumption and Production\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) can be used for traceability, tracking food production from seed to sale.\r\nLink to Evidence: http://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\n===========\r\n13: Climate Action\r\n===========\r\n\r\nDrupal is used by 10% of the top 10,000 sites on the web, and 3% of the top 1 million. (https://trends.builtwith.com/cms/Drupal)  By total traffic served rather than raw count the share may be even higher. 1 in roughly every 35 websites a user visits is likely to be a Drupal site. This means that optimizing the energy usage of the Drupal software has a significant impact on carbon emissions for major web properties all over the world. \r\n\r\nThe Drupal project is committed to evaluating the environmental impact and sustainability of it's software, and is partnering with major organizations such as Google to help improve the performance and thus carbon footprint of the web. \r\nhttps://www.drupal.org/about/sustainability \r\nhttps://www.youtube.com/watch?v=o7RgDIx8_90 \r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) is being used to measure on farm carbon capture.\r\nLink to Evidence: https://www.dell.com/en-us/perspectives/keeping-cows-happy-and-soil-healthy-with-ai-and-open-source-data-management/\r\n\r\n===========\r\n14: Life Below Water\r\n===========\r\nEvidence: Marine Ecosystem-Based Management \r\nLink to Evidence: http://webservices.itcs.umich.edu/drupal/mebm/\r\n\r\nEvidence: International Rivers \r\nLink to Evidence: https://www.internationalrivers.org/\r\n\r\nEvidence: Coral Reef Alliance \r\nLink to Evidence: https://coral.org/en/ \r\n\r\n===========\r\n15: Life on Land\r\n===========\r\nEvidence: The Climate Group  \r\nLink to Evidence: https://www.theclimategroup.org/\r\n\r\nEvidence: Rainforest Alliance   \r\nLink to Evidence: https://www.rainforest-alliance.org/ \r\n\r\n===========\r\n16: Peace, Justice and Strong Institutions\r\n===========\r\nEvidence: United Nations website\r\nLink to Evidence: https://www.un.org/en\r\n\r\nEvidence: LocalGov Drupal is a publicly owned asset that delivers a better digital experience for citizens, improves service outcomes, and saves money\r\nLink to Evidence: https://localgovdrupal.org/\r\n\r\nEvidence: The Drupal4Gov community is a non-profit organization dedicated to promoting the use of Drupal and other open source technologies in government institutions: \r\nLink to Evidence: https://drupal4gov.us \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nEvidence: Ashoka.org \r\nLink to Evidence: https://www.ashoka.org/en-us \r\n\r\nEvidence: The Sustainable Development Goals website\r\nLink to Evidence: https://sdgs.un.org/goals"
        },
        {
            "sdg": "SDG17: Partnerships for the Goals",
            "relevance": "Drupal supports the Sustainable Development Goals in 2 parallel ways: \r\n\r\nDirect support, in which the Drupal project itself advances the goals. \r\nIndirect support, in which Drupal empowers other organizations to advance the SDGs. \r\n\r\nIn fact, https://sdgs.un.org/goals is a Drupal site! In addition, there are other already recognized Digital Public Goods, such as FarmOS(https://www.drupal.org/project/farm), that are built with Drupal as the foundation. \r\n\r\n===========\r\nDirect support:  \r\n===========\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\n\r\nTarget 8.2: Diversify, innovate and upgrade for economic productivity\r\nTarget 8.5: Full employment and decent work with equal pay\r\n\r\nBecause Drupal is an innovative and market leading software platform--that is open source and based on common technology standards--provides direct opportunities for economic empowerment. \r\n\r\nAs an open source project with robust multilingual support a global community of contributors, Drupal is available to anyone, without licensing fees, dramatically lowering the start-up cost of digital business for entrepreneurs around the world. \r\n\r\nFurthermore, Drupal jobs are tech jobs, not gate-kept traditional degrees or mandatory certifications, and can be done from anywhere in the world. \r\n\r\nAs an open source project, Drupal supports entrepreneurs who want to build a new business opportunity on the web. This is reflected in the nearly 1 million websites using Drupal today: https://www.drupal.org/project/usage/drupal \r\n\r\nOn the enterprise scale as well, analysts like Gartner and Forrester see significant economic opportunities in the use of open source softwares: https://www.forrester.com/blogs/what-open-sources-collision-with-paas-means-for-drupal-and-wordpress-services-forr-in-3-video/ \r\n\r\nThere is also an ecosystem of more than a thousand Drupal agencies hiring Drupal talent in nearly every country in the world, and tens of thousands of end-users who need the same talent. Because Drupal is a widely adopted technology in both the private and public sector, Drupal empowers those who learn it with more bargaining power and more opportunities for jobs in Open Source technology. Demand is high enough that the Drupal Association maintains jobs.drupal.org as a platform to connect talented Drupal developers to employment opportunities. \r\nhttps://www.drupal.org/drupal-services \r\nhttps://jobs.drupal.org\r\nhttps://www.indeed.com/jobs?q=Drupal+Developer&l=&vjk=c4545e0824ca3195 \r\n\r\nFinally communities all of the world have local associations that connect emerging Drupal talent with economic opportunities in their area: \r\nhttps://www.drupal.org/node/3069614 \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nTarget 10.1: Reduce income inequalities\r\nTarget 10.2: Promote universal social, economic and political inclusion\r\n\r\nOpen source software such as Drupal offers a counter-balance to traditional economic models that extract resources from developing nations rather than providing them resources. An internet based on proprietary technology, patents, and trademarks replicates the wealth extraction of private industry, and crowds out entrepreneurship. It puts the wealth and value in only a few hands.\r\n\r\nIn contrast Drupal and the open web focus on providing a free and open internet, where that economic opportunity is accessible to all. In particular, Drupal empowers low-income users around the globe in two key ways.\r\n\r\nEntrepreneurship - In the last two decades, entrepreneurs have built businesses based on Drupal all over the world, participating in an ecosystem of almost $4 billion of economic activity. Many of these entrepreneurs are economically disadvantaged and underprivileged regions of the world. \r\n\r\n\r\nEvidence: Geographical Drupal groups: https://groups.drupal.org/og/all?keys=>_tid[]=141\r\n\r\nEvidence: The Drupal Association just hosted a Young Africa Leaders Initiative fellow - https://www.drupal.org/association/blog/drupal-association-selected-to-host-denaya-dennis-a-young-african-leader \r\n\r\nSocial, economic, and political inclusion: The open web can be a powerful equalizer. In contrast to the increasingly proprietary platforms dominating web publishing, Drupal can be used by anyway to promote a social message or political point of view. \r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nTarget 17.6: Knowledge sharing and cooperation for access to science, technology and innovation\r\nTarget 17.7: Promote sustainable technologies to developing countries\r\nTarget 17.8: Strengthen the science, technology and innovation capacity for least-developed countries\r\nTarget 17.16: Enhance the global partnership for sustainable development\r\nTarget 17.17: Encourage effective partnerships\r\nTarget 17.18: Enhance availability of reliable data\r\n\r\nDrupal's support of goal 17 is best exemplified by the next section, \"Indirect Support\", in which we discuss the hundreds or even thousands of mission driven organizations and government agencies that have chosen Drupal to advance their goals and the SDGs. \r\n\r\nDrupal is often the hub of the digital presence of all of these organizations- allowing them to promote, monitor, and report on their progress in advancing the SDGs. \r\n\r\nThe United Nations itself uses Drupal to publish, promote, and coordinate the SDGs- helping to grow the international partnership: \r\nhttps://sdgs.un.org/topics/technology\r\nhttps://sdgs.un.org/topics/multi-stakeholder-partnerships-and-voluntary-commitments\r\nhttps://partnershipaccelerator.netlify.app/\r\n\r\nEvidence: Government and non-profit Drupal case studies from around the world: https://www.drupal.org/case-studies?sectors%5B%5D=24660§ors%5B%5D=24496 \r\n(See specific case studies below)\r\n\r\n\r\n\r\n\r\n======================\r\nIndirect support: \r\nAnd evidence for 17: Partnerships for the Goals\r\n======================\r\n\r\nThere are hundreds of organizations using Drupal to further their missions and advance the SDGs. Examples of organizations using Drupal to support each one of the SDGs is included below. The links to evidence link directly to the Drupal sites supporting each. \r\n\r\nThere are many more examples of each category that could be provided as additional support. \r\n\r\nSee Drupal Nonprofit List here\r\n\r\n===========\r\n1: End Poverty in all its forms everywhere\t\r\n===========\r\n\r\nEvidence: Even post-2015 the Millennium Campaign works to promote the MDGs, underlining their impact and that they continue to be a sound and worthwhile investment for all in the fight against global poverty.\r\nLink to Evidence: https://www.endpoverty2015.org/\r\n\r\nEvidence: For 40 years and in more than 40 countries, Mercy Corps has helped communities forge new paths to prosperity in the face of disaster, poverty, and the impacts of climate change. \r\nLink to Evidence: https://www.mercycorps.org/ \r\n\r\nEvidence: The Elder Index is a measure of the income that older adults need to meet their basic needs and age in place with dignity.\r\nLink to Evidence: https://elderindex.org/about\r\n\r\n===========\r\n2: Zero Hunger\r\n===========\r\n\r\nEvidence: UNICEF works to prevent all forms of malnutrition by improving children’s and women’s access to nutritious, safe, affordable and sustainable diets. We support quality nutrition, health, water and sanitation, and social protection services that keep children well nourished. We also promote optimal feeding, hygiene and care practices for children and women.Where prevention falls short, UNICEF prioritizes the early detection, treatment and care of malnourished children to help them survive, recover, and go on to live healthy and productive lives. Through nutrition programmes in 130 countries, we seek to reach children, adolescents and women everywhere – at key moments in life.\r\nLink to Evidence: https://www.unicef.org/nutrition\r\n\r\n===========\r\n3: Good Health and Well-Being\r\n===========\r\n\r\nEvidence: Doctors Without Borders/Médecins Sans Frontières (MSF) cares for people affected by conflict, disease outbreaks, natural and human-made disasters, and exclusion from health care in more than 70 countries.\r\nLink to Evidence: https://www.doctorswithoutborders.org/\r\n\r\nEvidence: The CDC's National Prevention Information Network was the central portal for managing the COVID-19 response in the United States.\r\nLink to Evidence: https://npin.cdc.gov/ \r\n\r\nEvidence: The Infant and Young Child Feeding (IYCF) Image Bank is a collection of over 900 images, developed from adaptations of UNICEF’s Community Infant and Young Child Feeding Counselling Package; these, and other similar images about recommended IYCF practices, have been used in more than 70 countries for counseling and training to promote behavior change for improved maternal and child nutrition.\r\nLink to Evidence: https://iycf.advancingnutrition.org\r\n\r\nEvidence: The TB DIAH Data Hub is part of the United States Agency for International Development's performance-based measures to end TB—the Global Accelerator to End Tuberculosis—and contains data and information for decision-making.\r\nLink to Evidence: https://hub.tbdiah.org\r\n\r\nEvidence: The Delta Center for a Thriving Safety Net brings together primary care associations and behavioral health state associations to advance policy and practice change; our ultimate goal is to cultivate health policy and a care system that is more equitable and better meets the needs of individuals and families. \r\nLink to Evidence: https://deltacenter.jsi.com\r\n\r\nEvidence: The goal of the High Performing Health Care System tool is to provide information about the functionality of health systems processes, functions, and intermediate outcomes.\r\nLink to Evidence: https://hphctool.org\r\n\r\nEvidence: The goal of the Child Health Task Force is to strengthen equitable and comprehensive child health programs - focused on children aged 0-19 years in line with Global Strategy for Women’s, Children’s and Adolescents' Health (2016-2030) - through primary health care, inclusive of community health systems.\r\nLink to Evidence: https://www.childhealthtaskforce.org\r\n\r\nEvidence: The Reproductive Health National Training Center (RHNTC) is your go-to source for family planning and adolescent health training and technical assistance.\r\nLink to Evidence: https://rhntc.org\r\n\r\nEvidence: STOP Spillover works with in-country stakeholders to understand and address the threats posed by zoonotic viral diseases and reduce the risk of viral spillover and spread.\r\nLink to Evidence: https://stopspillover.org\r\n\r\nEvidence: USAID Advancing Nutrition envisions a world where countries, communities, and families are well nourished, resilient, and able to thrive.\r\nLink to Evidence: https://www.advancingnutrition.org\r\n\r\nEvidence: The Country Health Information Systems and Data Use project (CHISU) strengthens country capacity, leadership, and self-reliance to manage and use high-quality health information systems to improve evidence-based decision-making.\r\nLink to Evidence: https://chisuprogram.org\r\n\r\nEvidence: The Information Mobilized for Performance Analysis and Continuous Transformation (IMPACT) Team approach is a structured supply chain problem solving and action planning approach; the IMPACT Team Portal is a hub for training these teams and measuring their performance in Kenya, Mozambique, Sierra Leone, and Tanzania.\r\nLink to Evidence: https://scdatause.org\r\n\r\nEvidence: The USAID COVID-19 Technical Assistance Implementing Partners Forum is a platform for bi-directional sharing of updates, experiences, and ideas to increase the potential effectiveness of USAID’s COVID-19 investments.\r\nLink to Evidence: https://covidvaccineipforum.jsi.com\r\n\r\nEvidence: The Strengthening Systems of Care for People with HIV and Opioid Use Disorder Project provides coordinated technical assistance (in nine states) across HIV and behavioral health/substance use to ensure that people with HIV and OUD have access to care, treatment, and recovery services that are client-centered and culturally responsive.\r\nLink to Evidence: https://ssc.jsi.com\r\n\r\nEvidence: The Access Collaborative dashboard houses data and information on policies related to the roll-out of DMPA-SC (an injectable contraceptive) in 20 countries.\r\nLink to Evidence: https://dashboard.access-collaborative.com\r\n\r\nEvidence: Advancing Partners & Communities (APC) advances and supports community programs that seek to improve the overall health of communities and achieve other health-related impacts, especially in relationship to family planning.\r\nLink to Evidence: https://www.advancingpartners.org\r\n\r\nEvidence: The Strengthening Partnerships, Results, and Innovations in Nutrition Globally project (SPRING) was dedicated to strengthening global and country efforts to scale up high-impact nutrition practices and policies; SPRING provided state-of-the-art technical support focused on preventing stunting and maternal and child anemia in the first 1,000 days, linking agriculture and nutrition, and creating social and behavior change through communication.\r\nLink to Evidence: https://www.spring-nutrition.org\r\n\r\nEvidence: farmOS (built with Drupal) is used to track lab results that test food quality and compare against soil health practices.\r\nLink to Evidence: https://proofingfuture.eu/2022/02/09/bionutrient-food-association/\r\n\r\n===========\r\n4: Quality Education\r\n===========\r\nTarget 4.3: Equal access to affordable technical, vocational and higher education\r\nTarget 4.4: Increase the number of people with relevant skills for financial success\r\n\r\nDrupal as an open source project allows self-service technical education that is practically focused on highly relevent technical skills that will server people well in their technical careers.\r\n\r\nIn addition Drupal Association is a US-based 501c3 non-profit organization serving a global community. A core part of the Drupal Association and Drupal project's mission is to provide technology education at both in-person and online events. It is our belief that non-traditional education in technology skills is a tool for economic empowerment, and levels the playing field of earning opportunities for people across the globe. \r\n\r\nThe Drupal project and Association do this in a variety of ways: \r\nEducational sessions and content at DrupalCon: \r\nhttps://www.drupal.org/association/drupalcon/locations \r\n\r\nA contribution mentorship program: \r\nhttps://www.drupal.org/community/contributor-guide/contribution-areas/mentor\r\n\r\nThe Discover Drupal program, an educational and career development program designed to uplift members of marginalized communities:  \r\nhttps://www.drupal.org/association/discover-drupal \r\n\r\nFostering a global community of educators offering contribution mentorship and training: \r\nhttps://www.drupal.org/community/events \r\n\r\nAnd a network of training partners:\r\nhttps://www.drupal.org/training  \r\n\t\r\nEvidence: “71% of the top 100 universities use Drupal” (in image on page)\r\nLink to Evidence: https://www.drupal.org/industries/education\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Makerere University\r\nLink to Evidence: https://www.mak.ac.ug\r\n\r\nEvidence: University of Maryland\r\nLink to Evidence: https://umd.edu\r\n\r\nEvidence: University of New Hampshire\r\nLink to Evidence: https://www.unh.edu\r\n\r\n(this could be hundreds of examples)\r\n\r\n===========\r\n5: Gender Equity\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: UN Women\r\nLink to Evidence: https://www.unwomen.org/en\r\n\r\nEvidence: USAID (Gender Equality and Women’s Empowerment one of many areas of focus)\r\nLink to Evidence: https://www.usaid.gov/what-we-do/gender-equality-and-womens-empowerment\r\n\r\n===========\r\n6: Clean Water and Sanitation\r\n===========\r\n\r\nEvidence: A farmOS Produce Safety module was developed by the University of Vermont, which includes recordkeeping for on-farm water quality testing and worker hygiene requirements (farmOS is built with Drupal).\r\nLink to Evidence: https://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\nEvidence: Drop in the Bucket \r\nLink to Evidence: https://dropinthebucket.org/ \t\r\n\r\n===========\r\n7: Affordable and Clean Energy\r\n===========\r\n\r\nEvidence: Solar Energy West Africa \r\nLink to Evidence: http://solar-afrika.de/\r\n\r\n===========\r\n8: Decent Work and Economic Growth\r\n===========\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: Labor Community Strategy Center \r\nLink to Evidence: https://thestrategycenter.org/\r\n\r\nEvidence: Institute on Work and Health \r\nLink to Evidence: https://www.iwh.on.ca/ \r\n\r\n===========\r\n9: Industry, Innovation and Infrastructure\r\n===========\r\nTarget 9.C: Universal access to information and communications technology\r\n\r\nIn combination with other software components that makeup an Open Web, Drupal provides an open, free, and not-centrally controlled publishing platform that is part of making a free and open internet infrastructure. \r\n\r\nWhile this target is primarily focused on the *access* side of the innovation and infrastructure equation; that is, do people have affordable access to mobile networks and the internet - we fundamentally believe that this is not complete without also having access and control to *publish* their own words on these networks. \r\n\r\nThe Drupal project is philosophically aligned with the principles of the 'Open Web' - and in particular provides a web publishing platform that is not dependent on a centrally managed proprietary or government platform. By using Drupal, for free, individuals and organizations in any part of the world can own their platform and publish their content on the web freely. \r\n\r\nUsage of Drupal for more direct infrastructure innovation: \r\n\t\r\nEvidence: farmOS (built in Drupal) provides record keeping and planning tools for farmers to monitor their operations.\r\nLink to Evidence: https://opensensing.com/open-source-agtech-iot-ecosystem/\r\n\r\nEvidence: Technology for Agriculture \r\nLink to Evidence: https://www.fao.org/teca/\r\n\r\nEvidence: Global Center for Technology in parliament \r\nLink to Evidence: https://www.ictparliament.org/ \r\n\r\n===========\r\n10: Reduced Inequalities\r\n===========\r\n\r\nEvidence: Center for Reproductive rights \r\nLink to Evidence: https://reproductiverights.org/\r\n\r\nEvidence: Enough Project \r\nLink to Evidence: https://enoughproject.org/\r\n\r\nEvidence: Amnesty International \r\nLink to Evidence: https://www.amnesty.org/en/\r\n\r\nEvidence: Crea \r\nLink to Evidence: https://creaworld.org/ \r\n\r\n===========\r\n11: Sustainable Cities and Communities\r\n===========\r\n\r\nEvidence: GreenPeace UK \r\nLink to Evidence: https://www.greenpeace.org.uk/\r\n\r\nEvidence: National Environmental Education Week \r\nLink to Evidence: https://www.neefusa.org/education/eeweek\r\n\r\nEvidence: My Green Space \r\nLink to Evidence: https://www.mygreenspace.net/ \r\n\r\n===========\r\n12: Responsible Consumption and Production\r\n===========\r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) can be used for traceability, tracking food production from seed to sale.\r\nLink to Evidence: http://blog.uvm.edu/cwcallah/produce-tracking-and-traceability\r\n\r\n===========\r\n13: Climate Action\r\n===========\r\n\r\nDrupal is used by 10% of the top 10,000 sites on the web, and 3% of the top 1 million. (https://trends.builtwith.com/cms/Drupal)  By total traffic served rather than raw count the share may be even higher. 1 in roughly every 35 websites a user visits is likely to be a Drupal site. This means that optimizing the energy usage of the Drupal software has a significant impact on carbon emissions for major web properties all over the world. \r\n\r\nThe Drupal project is committed to evaluating the environmental impact and sustainability of it's software, and is partnering with major organizations such as Google to help improve the performance and thus carbon footprint of the web. \r\nhttps://www.drupal.org/about/sustainability \r\nhttps://www.youtube.com/watch?v=o7RgDIx8_90 \r\n\r\nEvidence: Drupal.org sustainability page\r\nLink to Evidence: https://www.drupal.org/about/sustainability\r\n\r\nEvidence: farmOS (built with Drupal) is being used to measure on farm carbon capture.\r\nLink to Evidence: https://www.dell.com/en-us/perspectives/keeping-cows-happy-and-soil-healthy-with-ai-and-open-source-data-management/\r\n\r\n===========\r\n14: Life Below Water\r\n===========\r\nEvidence: Marine Ecosystem-Based Management \r\nLink to Evidence: http://webservices.itcs.umich.edu/drupal/mebm/\r\n\r\nEvidence: International Rivers \r\nLink to Evidence: https://www.internationalrivers.org/\r\n\r\nEvidence: Coral Reef Alliance \r\nLink to Evidence: https://coral.org/en/ \r\n\r\n===========\r\n15: Life on Land\r\n===========\r\nEvidence: The Climate Group  \r\nLink to Evidence: https://www.theclimategroup.org/\r\n\r\nEvidence: Rainforest Alliance   \r\nLink to Evidence: https://www.rainforest-alliance.org/ \r\n\r\n===========\r\n16: Peace, Justice and Strong Institutions\r\n===========\r\nEvidence: United Nations website\r\nLink to Evidence: https://www.un.org/en\r\n\r\nEvidence: LocalGov Drupal is a publicly owned asset that delivers a better digital experience for citizens, improves service outcomes, and saves money\r\nLink to Evidence: https://localgovdrupal.org/\r\n\r\nEvidence: The Drupal4Gov community is a non-profit organization dedicated to promoting the use of Drupal and other open source technologies in government institutions: \r\nLink to Evidence: https://drupal4gov.us \r\n\r\n===========\r\n17: Partnerships for the Goals\r\n===========\r\n\r\nEvidence: Ashoka.org \r\nLink to Evidence: https://www.ashoka.org/en-us \r\n\r\nEvidence: The Sustainable Development Goals website\r\nLink to Evidence: https://sdgs.un.org/goals"
        }
    ],
    "openStandards": [
        "Accessibility standards: \r\nhttps://www.drupal.org/about/features/accessibility\r\nW3C WCAG standards\r\nWCAG 2.1 AA \r\nATAG 2.0 \r\nWAI-ARIA\r\nSection 508/ADA (depending on how the site-owner implements their site) \r\nGAAD Pledge - https://www.drupal.org/association/blog/gaad-pledge-2022-extending-drupals-accessibility \r\n\r\n\r\nGeneral technical standards for interoperability: \r\nHTTPS\r\nSSL\r\nOAuth2\r\nOIDC\r\nJWT\r\nUTF-8\r\nHTML\r\nCSS\r\nREST (Representational State Transfer)\r\nOpenAPI\r\nJSON\r\nJSON:API\r\nOPML\r\nRSS\r\nPSR-4: Autoloader\r\nES6\r\n\r\n\r\nCore standards for Accessibility:\r\nhttps://www.drupal.org/about/core/policies/core-change-policies/core-gates#accessibility \r\nhttps://www.drupal.org/docs/develop/standards/accessibility-coding-standards \r\n\r\nDocumentation and automated tests: \r\nhttps://www.drupal.org/docs/develop\r\nhttps://git.drupalcode.org/project/drupal/-/tree/10.1.x/core/tests\r\nhttps://git.drupalcode.org/project/drupal/-/tree/10.1.x/core/modules/rest/tests/src\r\nhttps://git.drupalcode.org/project/drupal/-/tree/10.1.x/core/modules/jsonapi/tests\r\nhttps://git.drupalcode.org/project/drupal/-/tree/10.1.x/core/modules/views/tests\r\n\r\nAdditional testing tools that are part of regular Druipal development: \r\nhttps://wave.webaim.org/\r\nhttps://chrome.google.com/webstore/detail/axe-devtools-web-accessib/lhdoppojpmngadmnindnejefpokejbdd\r\nhttps://www.nvaccess.org/download/\r\n"
    ],
    "bestPractices": [
        "Drupal's best practices are maintained and documented by the community here:\r\n\r\nCore development policies and practices - https://www.drupal.org/about/core/policies \r\nCoding standards - https://www.drupal.org/docs/develop/standards \r\nAutomated tests - https://www.drupal.org/docs/automated-testing\r\n\r\nDrupal is also a member of the Open Source Initiative: https://opensource.org/\r\n\r\nThe latest automated test results: \r\nhttps://www.drupal.org/node/3060/qa \r\n(click into individual results for details on specific tests",
        " for example: https://www.drupal.org/pift-ci-job/2625617 - click on 'show all' test classes) \r\n"
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored and distributed.",
        "typesOfPIIDataCollected": [
            "This response reiterates the answer given for the section '7. Privacy and Appicable laws' portion of the application.\r\n\r\nBecause Drupal is a software platform that can be used",
            " hosted",
            " modified",
            " extended",
            " etc by any user in any environment",
            " it is designed to empower users to limit the scope of the data they choose to collect",
            " store that data in a secure way",
            " and use secure methods for transmission where necessary. \r\n\r\nThe specific data being collected depends on the implementation choices of the site owner",
            " and the details of their hosting environment. Drupal when used in a Healthcare environment may have a far different implementation (for HIPAA compliance) than Drupal used for a community site. \r\n\r\nThat said",
            " there are many websites in healthcare and government that use Drupal in configurations designed to safely manage PII data. \r\nExamples: https://www.drupal.org/case-studies?sectors%5B%5D=24660&sectors%5B%5D=25214\r\n\r\nFurthermore",
            " Drupal.org itself",
            " the home of the Drupal project",
            " implements our own privacy protections and duty of care when handling PII: \r\nhttps://www.drupal.org/privacy\r\nhttps://www.drupal.org/drupalorg/docs/maintenance/protecting-user-pii\r\n"
        ],
        "dataPrivacySecurity": "Drupal's handling of PII, like any software platform in isolation, is based on the specific implementation of the site owner building on top of it. \r\n\r\nThe Drupal project adopts development standards for secure code, as well as implementing automated testing:\r\nhttps://www.drupal.org/about/core/policies\r\n\r\nAnd the Drupal security team provides educational materials to help people extending Drupal write secure code: \r\nhttps://www.drupal.org/docs/security-in-drupal/writing-secure-code-for-drupal\r\n\r\nAnd 3rd party saas providers who have built offerings on top of Drupal have often built their PII management solutions in accordance with standards and regulations, such as HIPAA:  \r\nhttps://docs.acquia.com/cloud-platform/arch/security/compliance-standards-and-regulations/\r\nhttps://pantheon.io/security\r\nhttps://platform.sh/security/\r\nhttps://www.amazee.io/industry/government\r\n"
    },
    "userContent": {
        "contentManagement": "Content is collected stored and distributed.",
        "contentTypes": [
            "Drupal is a highly flexible open source content management system",
            " so the types of content that can be collected/stored/distributed are unlimited. "
        ],
        "contentManagementPolicy": "Ultimately, site owners are individually responsible for the content policies they enact when using Drupal to build a content platform in their jurisdiction. \r\n\r\nDrupal provides a variety of tools and integrations that can be used to help prevent the submission of inappropriate or illegal content.\r\n\r\nWhen content is being entered by a centrally managed editorial team, site owners can implement tools provided by: https://www.drupal.org/docs/8/core/modules/content-moderation/overview\r\n\r\nWhen content is user-generated or user-submitted, Drupal site owners can implement integration with third party tools such as the Google Cloud Vision API to aid in inappropriate/illegal content detection, and/or implement community moderation tools such as content flagging/reporting. \r\n\r\n\r\nUse of inappropriate/illegal content is also against the Drupal's community code of conduct and values and principles:\r\nhttps://www.drupal.org/dcoc\r\nhttps://www.drupal.org/about/values-and-principles\r\n\r\nFinally, Drupal.org itself, the community website where open source contributors come together to build Drupal, has a firm stance against inappropriate and illegal content and both staff and community moderators help protect the community's home. \r\n\r\nhttps://www.drupal.org/terms"
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "Again, the distinction between Drupal as a software platform and Drupal as a community project is important.\r\n\r\nAs a software platform:\r\n - Drupal provides site owners with all the tools they need to build robust content moderation policies and to empower moderators to mediate conflict between users/contributors/etc.\r\n - It is ultimately the responsibility of site owners to implement these best practices. \r\n\r\nAs a community: \r\n - Drupal has a firm stance against harassment, expressed in:\r\n    - The community code of conduct: https://www.drupal.org/dcoc\r\n    - Our values and principles: https://www.drupal.org/about/values-and-principles\r\n    - The Drupal.org terms of service: https://www.drupal.org/terms\r\n    - The DrupalCon code of conduct: https://events.drupal.org/code-conduct\r\n\r\nAnd furthermore, the Drupal Community Working Group is a community body empowered to promote community health and mediate conflict in the community:\r\n - https://www.drupal.org/community/cwg"
    },
    "locations": {
        "developmentCountries": [
            "Australia",
            "Austria",
            "Belgium",
            "Brazil",
            "Canada",
            "France",
            "Germany",
            "Hungary",
            "India",
            "Italy",
            "Jordan",
            "Netherlands",
            "New Zealand",
            "Norway",
            "Russia",
            "Spain",
            "Switzerland",
            "Ukraine",
            "United Kingdom",
            "United States of America"
        ],
        "deploymentCountries": [
            "Australia",
            "Austria",
            "Belgium",
            "Brazil",
            "Canada",
            "France",
            "Germany",
            "Hungary",
            "India",
            "Italy",
            "Jordan",
            "Netherlands",
            "New Zealand",
            "Norway",
            "Russia",
            "Spain",
            "Switzerland",
            "Ukraine",
            "United Kingdom",
            "United States of America"
        ]
    },
    "deploymentOrganisations": [
        " Gavi The Vaccine Alliance",
        "Joint United Nations Programme on HIV/AIDS",
        "United Nations Educational",
        " Scientific and Cultural Organization (UNESCO)",
        "United Nations Environment Programme",
        "United Nations Human Settlements Programme",
        "United Nations Industrial Development Organization",
        "World Health Organization (WHO)",
        "World Food Programme",
        "World Meteorological Organization",
        "World Tourism Organization",
        " World Bank"
    ],
    "deploymentCountriesDepartments": [
        "Drupal is plausibly the most popular open source content management system for use in government.\r\n\r\nThere are more than 240 government use cases documented in publicly submitted Drupal case studies: https://www.drupal.org/case-studies/community?sectors%5B%5D=24660\r\n\r\nAnd these are just the ones that have been submitted by end-users or agencies. \r\n\r\nSince 2015",
        " the community group Drupal4Gov has hosted annual conferences about Drupal usage in government: https://www.drupalgovcon.org/session/archive \r\n\r\nTo highlight a few prominent governmental usecases",
        " each of the following is a Drupal website:\r\nhttps://europa.eu\r\nhttps://un.org\r\nhttps://nasa.gov\r\nhttps://www.govcms.gov.au/\r\nhttps://npin.cdc.gov/\r\nhttps://va.gov \r\n\r\nAnd many more. "
    ],
    "otherDeploymentOrganisations": [
        "Nearly 1 million websites check back with Drupal.org for updates:\r\nhttps://www.drupal.org/project/usage/drupal\r\n\r\nPublic technology crawling tools (which cannot always detect if Drupal is in use) show at least 500",
        "000 active Drupal sites:\r\nhttps://trends.builtwith.com/cms/Drupal \r\n\r\nAnd nearly 2000 websites have been manually submitted as case studies to Drupal.org: \r\nhttps://www.drupal.org/case-studies/community"
    ],
    "awardsReceived": [
        "n/a\r\n\r\n========\r\nTo provide evidence of Drupal's geographic scale - the 20 countries indicated in the questions above are just the 20 regions which contribute the most to Drupal: \r\nhttps://www.drupal.org/blog/who-sponsors-drupal-development-2020-2021-edition#:~:text=top%20countries\r\n\r\nThere are Drupal users and Drupal contributors in almost every country in the world. "
    ],
    "id": "10499",
    "name": "Drupal",
    "categories": [
        "Open Software"
    ],
    "description": "Drupal is an open source content management system powering ambitious digital experiences across government, higher-ed, non-profit, and other sectors for more than 20 years.",
    "website": "https://www.drupal.org",
    "repositories": [
        {
            "name": "main",
            "url": "https://git.drupalcode.org"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Drupal Association, 501c3 and Dries Buytaert, Drupal Founder.",
            "clearOwnershipURL": "Website of the organization - https://drupal.org/association\r\nContact name - Tim Doyle - CEO \r\nContact email - tim.doyle@association.drupal.org \r\nContact name - Dries Buytaert - Project Lead/Founder, member of the Drupal Association Board\r\nContact email - dries@buytaert.net \r\n\r\nTrademark: https://www.drupal.org/about/trademark"
        }
    ],
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "Drupal ships with JSON and REST apis that can be used to extract or import all content, which are extensively documented here: \r\n\r\nhttps://www.drupal.org/docs/core-modules-and-themes/core-modules/jsonapi-module/api-overview\r\nhttps://www.drupal.org/docs/8/core/modules/rest/overview"
    },
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "Drupal",
            "website": "https://www.drupal.org",
            "org_type": "owner",
            "contact_name": " Timothy Lehnen  ",
            "contact_email": "tim@association.drupal.org"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "Because Drupal is a software platform that can be used, hosted, modified, extended, etc by any user in any environment, it is designed to empower site owners to adhere to international laws and regulations as easily as possible. \r\n\r\nHowever, compliance cannot be guaranteed, because in all cases full compliance depends on the implementation choices of the site owner, and the details of their hosting environment. The design of the software alone is not sufficient without the adopted best practices of the site owner or SaaS vendor with a solution built on top of Drupal. \r\n\r\nThat said there are Drupal sites actively used in compliance with every digital privacy regulation and law currently under enforcement, including but not limited to: \r\n\r\nEU: GDPR; US: CCPA, ADA, Section 508, FEDRAMP, HIPAA; Aus: Privacy Act + Privacy Amendment; Brazil: LGPD; Canada: CDA; DCIA, Chile: Ley 19,628; India: PDPB; etc, etc. ",
            "privacyComplianceURL": "Drupal's compliance, like any software platform in isolation, is based on the specific end-user building on top of it. However, Drupal endeavors to make it as easy as possible to comply with domestic and international regulations.\r\n\r\nSome resources Drupal provides: \r\nhttps://www.drupal.org/docs/getting-started/accessibility/accessibility-conformance-report-acr-process\r\nhttps://www.drupal.org/docs/extending-drupal/contributed-modules/contributed-modules/general-data-protection-regulation/getting-started\r\nhttps://www.drupal.org/project/drupal_gdpr_team\r\n\r\nContributed modules that aid site owners in compliance:\r\nhttps://www.drupal.org/project/gdpr\r\nhttps://www.drupal.org/project/gdpr_compliance\r\n\r\n3rd party (not managed or directed by the Drupal Association) Saas providers who have built offerings on top of Drupal that offer compliance support: \r\nhttps://docs.acquia.com/cloud-platform/arch/security/compliance-standards-and-regulations/\r\nhttps://pantheon.io/security\r\nhttps://platform.sh/security/\r\nhttps://www.amazee.io/industry/government\r\n\r\nMany government institutions are using Drupal for their own web portals, demonstrating their own compliance with their regulations using Drupal as the platform: \r\n\r\nThe European Commission itself has built their web presence on Drupal, and notes their use of Drupal in their compliance statement:\r\nhttps://commission.europa.eu/cookies-policy_en\r\n\r\nThe United Nations web presence is also built on Drupal, as the platform for their digital compliance:\r\nhttps://un.org \r\n\r\nGovCMS which is used for Australia's entire digital web presence in compliance with local and international regulations is built on Drupal:\r\nhttps://www.govcms.gov.au/\r\n\r\nand many others."
        }
    ],
    "aliases": ""
}
