	{
    "id": "10605",
    "name": "Ozim Platform",
    "sectors": [],
    "stage": "DPG",
    "aliases": [
        "Ozim"
    ],
    "categories": [
        "Open Software"
    ],
    "description": "The Ozim Platform is a revolutionary new tool that helps parents of young children stay connected and informed. It provides a secure, easy-to-use platform for parents to access resources, connect with other parents, and stay up-to-date on the latest news about early development and intervention. The Ozim Platform provides parents with the tools to monitor their child's development and intervene early if needed.",
    "website": "http://ozimplatform.com/en/?utm=en",
    "repositories": [
        {
            "name": "main",
            "url": "https://github.com/Ozim-Platform"
        }
    ],
    "sdgs": {
        "sdg": [
            "SDG3: Good Health and Well-Being",
            "SDG4: Quality Education"
        ],
        "relevance": "Ozim Platform promotes Sustainable Development Goals 3 and 4. In particular, indicator 3.D as it warns parents about children’s developmental delays to seek professional help and minimize the risks of childhood disability. Moreover, it also applies to indicators 4.2 and 4.2.1 because by teaching parents, we facilitate early intervention activities and better care at home to prepare children with special needs for primary education and keep track of their health, learning, and psychosocial well-being.\r\n"
    },
    "openlicenses": [
        {
            "openLicense": "BSD-3-Clause",
            "openLicenseEvidenceURLs": "https://github.com/flutter/flutter/blob/master/LICENSE"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Assem Tazhiyeva; Dana Mambetalina",
            "clearOwnershipURL": "https://drive.google.com/file/d/11Pg_eYhiZOtzLzmgN5xrFQTRWWYclgBs/view?usp=share_link"
        }
    ],
    "documentation": "https://github.com/Ozim-Platform/Ozim-Platform/blob/b9e2d7da92cb284cf4e90f730ba00a95156a8744/documents/Ozim%20Platform%20Admin%20Manual.pdf\r\n\r\nhttps://github.com/Ozim-Platform/Ozim-Platform/blob/b9e2d7da92cb284cf4e90f730ba00a95156a8744/documents/Ozim%20Platform%20Requirements%20for%20Access%20and%20Login.pdf\r\n\r\nhttps://github.com/Ozim-Platform/Ozim-Platform/blob/b9e2d7da92cb284cf4e90f730ba00a95156a8744/documents/Ozim%20Platform%20User%20Manual.pdf",
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "Non-PII data can be retrieved using the export function through the administrative part of the project. The data can be retrieved as reports (in CSV format) from pre-configured server requests that restrict access to personally identifiable information and provide only the non-PII data required for reporting. Access to these reports is restricted by roles to administrators and data managers."
    },
    "openStandards": [
        "\r\nHTTPS\r\nSSL\r\nSSH\r\n\r\nInternationalization (i18n)\r\nUTF-8\r\nISO-8859-1\r\nASCII\r\nWeb standards\r\nHTML\r\nCSS\r\nData Exchange/ Configuration formats\r\nJSON\r\nXML\r\nCSV\r\nStandard Content formats\r\nPDF\r\nMultimedia\r\nSVG (Scalable Vector Graphics)\r\nPNG (Portable Network Graphics)\r\nJPEG (Joint Photographic Experts Group)\r\nH.264 (H.264/MPEG-4 AVC)\r\nMP4 (MPEG-4 Part 14)\r\n"
    ],
    "bestPractices": [
        "The Ozim Platform was designed respecting the principles for digital development. \r\nDesign with the user. In order to structure and design the app we studied the informational needs of parents from different regions of Kazakhstan in two languages (Kazakh",
        " Russian). The data showed thematic preferences",
        " preferred study format and size (text",
        " video) of materials. Using the data we developed a beta version and invited an auditor with visual impairments to check the accessibility of the application for people with visual disorders. After approving the version by focus groups we launched an app in the markets: App Store",
        " Google Play.\r\nBe data driven. Our utmost goal is to provide parents of young children with reliable and scientifically based information and materials. We work with authors who are experts in the field of early intervention and early development. One of the important directions of our project is to convert scientific articles into an accessible language for parents. \r\nBe collaborative. In the beginning of the project we started to work with NGOs and the private sector in the field of early development and intervention. This collaboration led to mutually beneficial partnerships. Today we started to work with government sectors and social entrepreneurs for the widest coverage of the population and positive impact among users. "
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored but NOT distributed.",
        "typesOfPIIDataCollected": [
            "Nickname",
            " email",
            " children’s birth date "
        ],
        "dataPrivacySecurity": "Network segmentation and management of network passages using the Linux UFW Firewall. Setting access rights for each role (Administrator, User, etc.) in the backend there is only one user. Storing user passwords in hashed form"
    },
    "userContent": {
        "contentManagement": "Content is NOT collected NOT stored and NOT distributed.",
        "contentTypes": [],
        "contentManagementPolicy": ""
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "\r\nThe administrator moderates through the admin panel the interactions with or between users to protect them from abusive comments or harassment. \r\n"
    },
    "locations": {
        "developmentCountries": [
            "Kazakhstan"
        ],
        "deploymentCountries": [
            "Kazakhstan"
        ]
    },
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "Ozim Platform",
            "website": "http://ozimplatform.com/en/?utm=en",
            "org_type": "owner",
            "contact_name": " Ozim Platform  ",
            "contact_email": "ozim.project@gmail.com"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "The Law of the Republic of Kazakhstan dated May 21, 2013 No. 94-V \"On Personal Data and their Protection\". The General Data Protection Regulation (GDPR) 2016/679 of the European Parliament and of the Council in this Privacy Policy.\r\n",
            "privacyComplianceURL": "https://github.com/Ozim-Platform/Ozim-Platform/blob/b9e2d7da92cb284cf4e90f730ba00a95156a8744/documents/Ozim%20Platform%20PrivacyPolicy.pdf\r\n\r\nhttps://github.com/Ozim-Platform/Ozim-Platform/blob/b9e2d7da92cb284cf4e90f730ba00a95156a8744/documents/Ozim%20Platform%20Publicoffer.pdf"
        }
    ],
    "deploymentOrganisations": "",
    "deploymentCountriesDepartments": "",
    "otherDeploymentOrganisations": "",
    "awardsReceived": ""
}
