	{
    "id": "10782",
    "name": "Doptor Open Data",
    "sectors": [],
    "stage": "DPG",
    "aliases": [
        "Doptor"
    ],
    "categories": [
        "Open Data"
    ],
    "description": "Doptor Open Data aims to bring all the eServices owned by the Government of Bangladesh in a single platform. Doptor Open Data works as a middleware to serve all the government officials and offices with authentication and the most secure way. The concept of one id for one government office & official to access all the eService is implemented by Doptor Open Data Platform. This platform has the integration process to share the core data with other eServices.",
    "website": " http://dpgdata.doptor.gov.bd/  ",
    "repositories": [
        {
            "name": "main",
            "url": "http://dpgdata.doptor.gov.bd/ "
        }
    ],
    "sdgs": {
        "sdg": [
            "SDG3: Good Health and Well-Being",
            "SDG5: Gender Equity",
            "SDG9: Industry¸ Innovation and Infrastructure",
            "SDG10: Reduced Inequalities",
            "SDG11: Sustainable Cities and Communities",
            "SDG16: Peace¸ Justice and Strong Institutions",
            "SDG17: Partnerships for the Goals"
        ],
        "relevance": "(SDG 3: Good Health and Well-being):\r\n1.By providing authentic government officer information, the Doptor Open Data platform supports efficient healthcare service delivery.\r\n2.Accurate data helps in the allocation of healthcare resources, tracking health personnel, and ensuring effective responses to public health emergencies.\r\n(SDG 5: Gender Equality:)\r\n1.The Doptor Open Data platform contributes to gender equality by ensuring equal access to government services.\r\n2.By providing comprehensive and accurate information about government officers, it helps prevent gender-based discrimination and bias in service delivery.\r\n(SDG 9: Industry, Innovation, and Infrastructure:)\r\n1.Doptor Open Data platform promotes innovation by providing a framework for integrating and sharing data among different e-governance solutions.\r\n2.It contributes to the development of digital infrastructure and streamlines information exchange, leading to improved efficiency in service delivery.\r\n(SDG 10: Reduced Inequalities:)\r\n1.The platform helps reduce inequalities by enabling the sharing of office-related data, making government services more accessible and equal for all individuals.\r\n2.It ensures that information about office locations, ministries, and designations is readily available, reducing disparities in service provision.\r\n(SDG 11: Sustainable Cities and Communities:)\r\n1.The platform's features related to municipalities, city corporations, and thanas support the development of sustainable cities and communities.\r\n2.By providing accurate information and facilitating data sharing, the platform aids in efficient urban planning, governance, and decision-making. It helps ensure that cities and communities have access to reliable data for effective management and development.\r\n(SDG 16: Peace, Justice, and Strong Institutions:)\r\n1.Doptor Open Data platform enhances the transparency and accountability of institutions by providing accurate and up-to-date government officer information.\r\n2.It ensures that government entities have access to reliable data, fostering trust and integrity in governance processes.\r\n(SDG 17: Partnerships for the Goals:)\r\n1.The platform facilitates partnerships between e-governance solutions by enabling the exchange of data.\r\n2.It encourages collaboration among various stakeholders, including government agencies, to work towards common goals of efficient and effective service delivery.\r\n"
    },
    "openlicenses": [
        {
            "openLicense": "MIT",
            "openLicenseEvidenceURLs": "https://dpgdata.doptor.gov.bd/license \r\n"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Aspire to Innovate (a2i) Programme (A Multinational Digital Transformation Catalyst from the Government of Bangladesh)",
            "clearOwnershipURL": "Project Domain:  https://dpgdata.doptor.gov.bd\r\nSource Code: https://github.com/Doptor-DPG/Doptor-OpenData/tree/master/ \r\nDocumentation: https://github.com/Doptor-DPG/Doptor-OpenData/tree/master/documentation "
        }
    ],
    "documentation": "All the documents related to this repository will be found at  : https://github.com/Doptor-DPG/Doptor-OpenData/tree/master/documentation \r\nList of Documents: \r\n1.Project Summary\r\n2.SDG\r\n3.FAQ\r\n4.Privacy Policy\r\n5.Terms and Conditions \r\n6.Adherence to Privacy and Applicable Laws\r\n7.Design Documentation\r\n8.Data Privacy and Security\r\n9.NON-PII Data Extraction\r\n\r\n\r\nAll the api documentation will be found at:\r\nhttps://dpgdata.doptor.gov.bd/documentation/v1  \r\n",
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "Mechanism for extracting or importing non-PII data from or into the system in a non-proprietary format:\r\nThe Doptor Open Data platform provides a mechanism for extracting or importing non-PII data from or into the system in a non-proprietary format. This mechanism ensures interoperability and facilitates the exchange of data with external systems or applications.\r\nThe specific details of the extraction or import mechanism may depend on the implementation of the platform. However, in general, the platform can adopt the following approaches:\r\n1.API-based Data Exchange: The platform can offer Application Programming Interfaces (APIs) that allow external systems or applications to programmatically extract or import non-PII data. These APIs provide standardized endpoints and data formats for seamless integration.\r\n2.Data Export/Import Functionality: The platform may provide built-in export and import functionalities within its user interface. Users with appropriate permissions can initiate the export or import process, specifying the desired data and format.\r\nBy providing these mechanisms, the Doptor Open Data platform allows for the extraction or import of non-PII data in a non-proprietary format. This promotes data interoperability, enhances data sharing capabilities, and facilitates integration with external systems or applications.\r\n"
    },
    "openStandards": [
        "Open Standards:\r\nOpen Data Protocol (OData)",
        " GeoJSON ",
        " W3C Web Annotation Data Model",
        " \r\nBest Practices:\r\nFAIR Data Principles",
        " OpenAPI Specification",
        " Linked Data Best Practices",
        " Data Licensing Best Practices",
        " \r\n"
    ],
    "bestPractices": [
        "Software Development Life Cycle (SDLC): Agile development; Architectural Design: SOLID principles of object-oriented programming; User Interface/ User Experience (UI/UX): Human-Centered Design Principles; Open Source: Best practices For Open Source Maintainers; Data Principles: FAIR Data Principles\r\n"
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored and distributed.",
        "typesOfPIIDataCollected": [
            "Doptor Open Data Platform distributed data by JSON (JavaScript Object Notation) Format.\r\nTypes of Data this platform is collected / stored / distributed data is given bellow:\r\nGeo Data: The platform encompasses different types of GEO locations",
            " ranging from Division to Union. It offers a basic structure for each GEO location",
            " starting from Division level down to Union level.\r\nGovernment Officer Information Services: Doptor provides the most authentic government officer information",
            " including employee names in both Bengali and English.\r\nOffice Data Sharing Services: Doptor Open Data Platform facilitates the sharing of office-related data with external applications.The shared office data includes information such as office names in both Bengali and English",
            " office IDs",
            " ministry names",
            " office layers",
            " office unit names",
            " officer unit Opens",
            " and office designations.\r\n"
        ],
        "dataPrivacySecurity": "Data Privacy Policy of the solution is given in the privacy policy page: https://dpgdata.doptor.gov.bd/privacy_policy \r\n\r\n\r\n"
    },
    "userContent": {
        "contentManagement": "Content is NOT collected NOT stored and NOT distributed.",
        "contentTypes": [],
        "contentManagementPolicy": ""
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "No",
        "harassmentPolicy": ""
    },
    "locations": {
        "developmentCountries": [
            "Bangladesh"
        ],
        "deploymentCountries": [
            "Bangladesh"
        ]
    },
    "deploymentCountriesDepartments": [
        "All Ministries of Bangladesh government uses this Data "
    ],
    "otherDeploymentOrganisations": [
        "N/A"
    ],
    "awardsReceived": [
        "N/A"
    ],
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "Doptor Open Data",
            "website": " http://dpgdata.doptor.gov.bd/  ",
            "org_type": "owner",
            "contact_name": " a2i  ",
            "contact_email": "dpg@a2i.gov.bd"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "List of relevant privacy, domestic, and other applicable international laws that the Doptor Open Data platform complies with:\r\nPrivacy Laws: such as:\r\n1.General Data Protection Regulation (GDPR) in the European Union.\r\n2.Personal Information Protection and Electronic Documents Act (PIPEDA) in Canada.\r\n3.California Consumer Privacy Act (CCPA) in the United States.\r\n4.Personal Data Protection Act (PDPA) in Singapore.\r\n5.Data Protection Act 2018 in the United Kingdom.\r\nDomestic Laws: such as:\r\n1.Bangladesh Digital Security Act 2018.\r\n2.Right to Information Act 2009.\r\n3.Bangladesh Telecommunication Act 2001.\r\nInternational Laws and Guidelines:\r\n1.United Nations Guidelines for the Regulation of Computerized Personal Data Files.\r\n2.Council of Europe Convention for the Protection of Individuals with regard to Automatic Processing of Personal Data (Convention 108).\r\n3.OECD Privacy Guidelines.\r\n",
            "privacyComplianceURL": "All the Evidence of adherence is listed in our privacy policy and terms and conditions.\r\nPrivacy Policy -  https://dpgdata.doptor.gov.bd/privacy_policy \r\nTerm Conditions - https://dpgdata.doptor.gov.bd/terms_of_service \r\n"
        }
    ],
    "deploymentOrganisations": ""
}
