	{
    "id": "10836",
    "name": "MentorED",
    "sectors": [],
    "stage": "DPG",
    "categories": [
        "Open Software"
    ],
    "description": "MentorED is an open source mentoring application that facilitates lifelong learning and continuous professional development by enabling discovery of trusted mentors and mechanisms.",
    "website": "https://elevate-docs.shikshalokam.org/docs/2.3/intro",
    "repositories": [
        {
            "name": "main",
            "url": "https://github.com/ELEVATE-Project/mentoring, https://github.com/ELEVATE-Project/user, https://github.com/ELEVATE-Project/mentoring-mobile-app"
        }
    ],
    "sdgs": {
        "sdg": [
            "SDG4: Quality Education",
            "SDG5: Gender Equity",
            "SDG10: Reduced Inequalities",
            "SDG17: Partnerships for the Goals"
        ],
        "relevance": "MentorED is an open source mentoring application that facilitates lifelong learning and continuous professional development by enabling discovery of trusted mentors and mechanisms. National Education Policy 2020 in India proposes mentoring as a solution at various levels to improve the quality of outcomes. \r\nThe National Council for Teacher Education (NCTE) proposes a nationwide mission to incorporate mentoring to improve the acquisition and sharing of knowledge, skills, and mindsets across the Indian education system.\r\nTeachers and School Heads need new solutions to today’s unprecedented demands and challenges. The community of educators and leaders in education in itself is rich with experts, who have the knowledge and skills to contribute towards problem-solving and capacity building of peers. Systems capable of adapting to the rapidly changing environment can empower their citizens with the right mix of skills to allow them to lead satisfying professional and personal lives. This leads to inclusive and sustainable economic growth. \r\nA structure of mentoring, therefore, offers a solution to address the existing gaps in a more decentralised manner. These are the gaps in accessing expertise, continuous professional development, connecting with peers from similar contexts and the absence of a platform to leverage cross-learning. MentorED will be leveraged to implement this nationwide mentoring mission for various outcomes of public education in India.\r\nMentorED, which is also an open-source NDEAR Compliant modular building block, is designed for scale and reliability. \r\nMentoringBlueBook - https://ncte.gov.in/WebAdminFiles/PublicNotice/English_0_04_11_2021_637716090580188670.pdf\r\n\r\nGood Health and Well Being : MentorED is an open source application that can be adopted in the health sector for using the application to increase knowledge among providers and hence provide better health and good well being for people. This is inspired by ECHO model- https://hsc.unm.edu/echo/what-we-do/about-the-echo-model.html. \r\n\r\nReduced Inequalities :\r\nMentorED is an open source application which provides an opportunity to leverage cross learning amongst different individuals leading to their continuous professional development. It makes mentoring accessible to any individual who needs it, regardless of age, background or ethnicities. Several programs will be conceptualised for grassroots inequity by nonprofits and government institutions.\r\n\r\n"
    },
    "openlicenses": [
        {
            "openLicense": "MIT",
            "openLicenseEvidenceURLs": "License URL: https://github.com/ELEVATE-Project/mentoring/blob/master/LICENSE,\r\nhttps://elevate-docs.shikshalokam.org/docs/2.3/intro"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "ShikshaLokam",
            "clearOwnershipURL": "1. ShikshaLokam page hosting the documentation publically : \r\nhttps://elevate-docs.shikshalokam.org/docs/2.3/intro\r\n\r\n2. License with ownership of ShikshaLokam clearly stated : \r\nhttps://github.com/ELEVATE-Project/mentoring/blob/master/LICENSE,\r\n\r\n3. Terms and conditions and Privacy policy\r\nhttps://shikshalokam.org/mentoring/privacy-policy,\r\nhttps://shikshalokam.org/mentoring/term-of-use"
        }
    ],
    "documentation": "Documentation URL for MentorED:  https://elevate-docs.shikshalokam.org/docs/2.3/intro\r\n",
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "MentorEd  has APIs and tools to manage users and transactional data which uses JSON as the native data format (https://github.com/ELEVATE-Project/mentoring/wiki/API-Documentation). In some cases, tools have been developed to support import and export in CSV format. Reports with non-PII are available for extraction via scripts."
    },
    "openStandards": [
        "Open Web Standard - HTML",
        " CSS",
        " JavaScript",
        " SVG\r\nSecurity - HTTPS\r\nNetworking - TCP/ IP\r\nData exchange - CSV/ JSOM\r\n"
    ],
    "bestPractices": [
        "Standards support evidence: https://elevate-docs.shikshalokam.org/docs/2.3/settingup-overview",
        "\r\nFind more details of principles:  https://elevate.shikshalokam.org/building-blocks/#architecture\r\n\r\nArchitecture best practices:\r\nUnified and not Uniform",
        "\r\nMicroservice Architecture",
        "\r\nSecure and reliable",
        "\r\nOpen Standards",
        "\r\nScalable and Resilient",
        "\r\nObservability",
        "\r\nTrusted Platform",
        "\r\nDecentralized and distributed",
        "\r\nPlatform Thinking",
        "\r\nEnabling Ecosystem",
        "\r\nExtensibility",
        "\r\nInclusive by design",
        "\r\nAdopt open standards and open source."
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored but NOT distributed.",
        "typesOfPIIDataCollected": [
            "Email ID is collected and stored .It is not distributed.  But",
            " adopters can attach more automated detection services within the curation pipeline.\r\n"
        ],
        "dataPrivacySecurity": "MentorED follows many best practices to keep user data safe and secure. No personal data is shared among collaborators and only with explicit consent of all participating individuals, a collaboration flow can be triggered. \r\n\r\nRegistrations of users are done in a regulated manner , for example there is a help page for reporting any issue. MentorED software implements principles of minimalism, consent, transparency of data collection, and other best practices. Please see earlier and following responses for details about privacy and data security.\r\n\r\nSome of the steps taken to ensure safety of users are:\r\n\r\nProfile controls to modify and manage data stored against user profile \r\nTwo-Factor Authentication (OTP based)\r\nUsers join a Group by accepting an invite. No one can add a user to a group without their consent.\r\nUsers can exit discussion areas at any time\r\nUsers agree to terms and condition \r\n\r\nWhile MentorED is built with all of the above capabilities and best practices, it is upto the adopter to implement these. MentorED as an open-source software is free to use and modify as required.\r\n\r\n"
    },
    "userContent": {
        "contentManagement": "Content is collected and stored but NOT distributed.",
        "contentTypes": [
            "Content like Session Meta and Recording of Mentoring sessions are collected and stored but not distributed. "
        ],
        "contentManagementPolicy": "MentorED follows many best practices to keep user data safe and secure. No personal data is shared among collaborators and only with explicit consent of all participating individuals, a collaboration flow can be triggered. \r\n\r\nRegistrations of users are done in a regulated manner , for example there is a help page for reporting any issue. MentorED software implements principles of minimalism, consent, transparency of data collection, and other best practices. Please see earlier and following responses for details about privacy and data security. The average response time for the reported issue is 24 hours \r\n\r\nSome of the steps taken to ensure safety of users are:\r\n\r\nProfile controls to modify and manage data stored against user profile \r\nTwo-Factor Authentication (OTP based)\r\nUsers join a Group by accepting an invite. No one can add a user to a group without their consent.\r\nUsers can exit discussion areas at any time\r\nUsers agree to terms and condition \r\n\r\nSessions are recorded for ensuring security; \r\nA support page to raise concerns; \r\nNo PII data is shared within the users ;\r\nNo communication is possible between the users outside the session;\r\n\r\nWhile MentorED is built with all of the above capabilities and best practices, it is upto the adopter to implement these. MentorED as an open-source software is free to use and modify as required.\r\n\r\nPolicy and terms of use : https://shikshalokam.org/mentoring/privacy-policy https://shikshalokam.org/mentoring/term-of-use\r\n"
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "MentorED follows best practices to keep user data safe and secure. No personal data is shared among collaborators and only with the explicit consent of all participating individuals, a collaboration flow can be triggered. Registrations of users are done in a regulated manner, for example, there is a help page for reporting any issue. MentorED software implements principles of minimalism, consent, transparency of data collection, and other best practices.\r\n\r\nSome of the steps taken to ensure the safety of users are:\r\n1. Profile controls to modify and manage data stored against the user profile;\r\n2. Two-Factor Authentication (OTP based);\r\n3. Users join a Group by accepting an invite (no one can add a user to a group without their consent);\r\n4. Users can exit discussion areas at any time;\r\n5. Users agree to the terms and conditions. \r\n\r\nProcesses that address the safety and security of underage users :\r\n6. Sessions are recorded for ensuring security; \r\n7. A support page to raise concerns; \r\n8. No PII data is shared within the users ;\r\n9. No communication is possible between the users outside the session;\r\n\r\nMentorED has microservices for reporting. But, typically adopters can extend this to cater to the specific needs of the users and processes within their context.\r\n"
    },
    "locations": {
        "developmentCountries": [
            "India"
        ],
        "deploymentCountries": [
            "India"
        ]
    },
    "deploymentCountriesDepartments": [
        "Department of National Council for Teacher Education",
        " Ministry of Education ",
        " Government of India"
    ],
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "MentorED",
            "website": "https://elevate-docs.shikshalokam.org/docs/2.3/intro",
            "org_type": "owner",
            "contact_name": " priyanka k mohan  ",
            "contact_email": "priyanka@shikshalokam.org"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "MentorED software has implemented best practices for data collection in an open and transparent manner, enabling adopters to collect data and consent - store it safely & securely - and share data anonymously. \r\n\r\nManagement of PII and non-PII data in MentorED is highly extensible, configurable, and non-opinionated through the open-software solution. Implementers/ adopters of MentorED, have the autonomy to decide which fields to capture/ maintain, what other systems will they integrate with, and decide if they share this data with other authorized parties (e.g. Government sharing data with other Governments, or one Department sharing this data with other Department). \r\n\r\nMentorED is compliant with National Digital Education Architecture (NDEAR) design principles architecture and building blocks and with India's Personal Data Protection Bill (2019),The IT Act (2000) for its implementation in India.",
            "privacyComplianceURL": "Links to Privacy Policy and Terms of Use : \r\nhttps://shikshalokam.org/mentoring/privacy-policy,\r\nhttps://shikshalokam.org/mentoring/term-of-use.\r\n\r\nWhile the MentorED technical architecture has taken privacy and security controls into consideration as default implementation, it is up to the implementers/ adopters to establish a privacy policy at their end to cover the various implementation scenarios and configure it to comply with the various laws and regulations governing data privacy, protection, and sharing."
        }
    ],
    "aliases": "",
    "deploymentOrganisations": "",
    "otherDeploymentOrganisations": "",
    "awardsReceived": ""
}
