	{
    "sdgs": {
        "sdg": [
            "SDG1: End Poverty in all its forms everywhere",
            "SDG17: Partnerships for the Goals"
        ],
        "relevance": "TruBudget can significantly lower high transaction costs that arise from cumbersome coordination and control efforts. As a result, official development assistance (ODA) becomes more targeted and measures are taken more effectively. By reducing transaction costs, more funds are ultimately available for the implementation of development-relevant measures, contributing to SDG1 (and other SDGs which rely on the use of funds for their progress) indirectly.,\r\n \r\nEvidence: By employing an innovative IT technology (distributed ledger/blockchain technology) this solution contributes to innovation in partner countries, by creating experience in the application and design of this open software based blockchain solution (especially linked to targets 9.b - Support domestic technology development, research and innovation in developing countries, including by ensuring a conducive policy environment for, inter alia, industrial diversification and value addition to commodities , 9.5 Enhance scientific research, upgrade the technological capabilities of industrial sectors in all countries, in particular developing countries, including, by 2030, encouraging innovation and substantially increasing the number of research and development workers per 1 million people and public and private research and development spending),\r\n \r\nAccording to the OECD, more than 500 different donor organisations offer assistance worldwide. In Burkina Faso for instance, 81 bi- and multilateral agencies are active. Each one has its own requirements, defines its own conditions and pursues its own goals. Burkina Faso must cope with all of the related demands. As a result, its ministries host over 300 different project teams. Acting on the initiative of the donors, these teams sometimes work at cross purposes in the same regions and sectors. TruBudget allows for the establishment of shared platforms that significantly expand donors' scope for using a partner country's systems. If funds are no longer channeled past the partner country's government structures but out of government structures in the partner country, this strengthens the partner country's capacities and its ownership. Donor contributions from different donors can be used in a coordinated manner in line with the respective national development policy priorities. This can drastically reduce the major coordination and administrative workload for the partner countries. (This is specifically (however not exclusively) geared toward the following targets: 17.01 Strengthen domestic resource mobilization, including through international support to developing countries, to improve domestic capacity for tax and other revenue collection, 17.14 Enhance policy coherence for sustainable development, 17.15 Respect each country’s policy space and leadership to establish and implement policies for poverty eradication and sustainable development Multi-stakeholder partnerships, 17.16 Enhance the global partnership for sustainable development, complemented by multi-stakeholder partnerships that mobilize and share knowledge, expertise, technology and financial resources, to support the achievement of the sustainable development goals in all countries, in particular developing countries, 17.17 Encourage and promote effective public, public-private and civil society partnerships, building on the experience and resourcing strategies of partnerships Data, monitoring and accountability)"
    },
    "sectors": [],
    "stage": "DPG",
    "openlicenses": [
        {
            "openLicense": "GPL-3.0",
            "openLicenseEvidenceURLs": "https://github.com/openkfw/TruBudget/blob/master/LICENSE"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "KfW",
            "clearOwnershipURL": "https://trademarks.justia.com/792/74/trubudget-79274337.html"
        }
    ],
    "documentation": "https://trubudget.net/docs/README/",
    "NonPII": {
        "collectsNonPII": "No",
        "nonPIIAccessMechanism": ""
    },
    "locations": {
        "developmentCountries": [
            "Austria",
            "Germany"
        ],
        "deploymentCountries": [
            "Brazil",
            "Burkina Faso",
            "Georgia",
            "Tunisia"
        ]
    },
    "id": "10883",
    "name": "TruBudget",
    "categories": [
        "Open Software"
    ],
    "description": "A blockchain-based workflow tool for an efficient and transparent project management",
    "website": "https://trubudget.net/",
    "repositories": [
        {
            "name": "main",
            "url": "https://github.com/openkfw/TruBudget"
        }
    ],
    "openStandards": [
        "HTML",
        " CSS",
        " ECMAScript",
        " REST\r\nhttps://github.com/openkfw/TruBudget "
    ],
    "bestPractices": [
        "Continous integration/ Continous Deployment - https://github.com/openkfw/TruBudget/tree/master/.github\r\n"
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is NOT collected NOT stored and NOT distributed.",
        "typesOfPIIDataCollected": [],
        "dataPrivacySecurity": ""
    },
    "userContent": {
        "contentManagement": "Content is NOT collected NOT stored and NOT distributed.",
        "contentTypes": [],
        "contentManagementPolicy": ""
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "TruBudget users are open source developers \r\n\r\nCode of conduct - https://github.com/openkfw/TruBudget/blob/master/CODE_OF_CONDUCT.md"
    },
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "TruBudget",
            "website": "https://trubudget.net/",
            "org_type": "owner",
            "contact_name": " Dr Ronald Steyer  ",
            "contact_email": "ronald.steyer@kfw.de"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "TruBudget does not contain any relevant data to GDPR or others, that is, it is a workflow engine. If relevant data is collected, the organization using the software has to ensure that the data is appropriately encoded or stored. Reference: https://github.com/openkfw/TruBudget/blob/master/README.md ",
            "privacyComplianceURL": "TruBudget is a workflow engine therefore does not contain any relevant data to GDPR. If relevant data is collected, the organizations using the software have to ensure that the data is appropriately encoded or stored. Reference: https://github.com/openkfw/TruBudget/blob/master/README.md "
        }
    ],
    "aliases": "",
    "deploymentOrganisations": "",
    "deploymentCountriesDepartments": "",
    "otherDeploymentOrganisations": "",
    "awardsReceived": ""
}
