	{
    "id": "10896",
    "name": "Boxtribute",
    "sectors": [],
    "stage": "DPG",
    "aliases": [
        "Stichting Boxwise",
        "Boxwise (formerly)",
        "BoxTribute"
    ],
    "categories": [
        "Open Software"
    ],
    "description": "An open-source digital system making it easy to rapidly and collaboratively source, store & distribute humanitarian aid to people in need in a fair and dignified way. ",
    "website": "https://www.boxtribute.org/",
    "repositories": [
        {
            "name": "main",
            "url": "https://github.com/boxwise/boxtribute"
        }
    ],
    "sdgs": {
        "sdg": [
            "SDG1: End Poverty in all its forms everywhere",
            "SDG12: Responsible Consumption and Production",
            "SDG17: Partnerships for the Goals"
        ],
        "relevance": "Our platform's most classic use targets SDG indicators 1.3-1.5, which includes providing basic services to people in poverty and other vulnerable situations, as well as improving the resilience of communities to disasters and other shocks,\r\n \r\nMuch of our work has to do with the distribution of non-food items (NFI), in particular clothing and shelter items, which are often donated by the public when they no longer suit the needs of the individual. Through our work, we allow many household items that are otherwise in good condition to be redirected away from landfill and waste, towards providing for the core needs of vulnerable people. Without our platform, many community groups would have no way of organizing the donated goods and matching that to the needs of the population.\r\n \r\nOne of the key aspects of our work and in our platform is around encouraging collaboration and interdependence between public interest actors, particularly humanitarian aid actors. We are rolling out in our design the ability for organizations not only to store and distribute aid, but also transfer that aid between each other in a collaborative and cooperative way."
    },
    "openlicenses": [
        {
            "openLicense": "Apache-2.0",
            "openLicenseEvidenceURLs": "https://github.com/boxwise/boxtribute/blob/master/LICENSE.md"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Boxtribute",
            "clearOwnershipURL": "https://www.boxtribute.org/"
        }
    ],
    "documentation": "Developer docs: https://github.com/boxwise/boxtribute#readme ;\r\nAPI docs: https://api.boxtribute.org/docs",
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "Export is handled through CSV within the application, and can also be exported via JSON in the API. See our hosted service documentation for examples. https://api.boxtribute.org/docs"
    },
    "openStandards": [
        "HTML",
        "CSS",
        "JavaScript",
        "GraphQL",
        "JSON.\r\nDesign with the User: we work closely with other organizations on the field and build trust as former field workers ourselves.\r\nUnderstand the Existing Ecosystem: One of our core principles is try to patch the gaps in the humanitarian system",
        " and reduce the areas of duplication and overlap. In fact",
        " our software is designed specifically for that purpose",
        " and we try to follow that principle as well in our own design and operations.\r\nBe Data Driven: We compare our impact and our methods not only with usage data of the software",
        " but also global humanitarian data. Both our long-term policies and day-to-day decisions make heavy use of this.\r\nBe Collaborative: We are always collaborative within the sector and across the sector. We attend conferences to give people a better idea of how things work internally. Here's an example of our work with other orgs to create a standard of aid distribution that is aligned with international SPHERE standards. https://drive.google.com/file/d/1uydhO--UtSx8VK_V9bHqj_4Qi-mO8OdP/view?usp=sharing\r\nAddress Privacy and Security: We not only follow GDPR guidelines ourselves",
        " but our software also encourages our users to follow those same guidelines by having simple privacy management modules for beneficiaries. "
    ],
    "bestPractices": [
        "We publicly list our user stories and are transparent with our Agile SDLC: https://trello.com/b/2Dn4bpqD/boxtribute-product-development-fully-public\r\n\r\nWe use semantic versioning for all our releases",
        " which you can see in our Github.\r\n\r\nPlease also look at our policy plan on how we approach humanitarian intervention. https://www.boxtribute.org/uploads/2021-2023-boxtribute-policy-plan.pdf\r\n"
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored but NOT distributed.",
        "typesOfPIIDataCollected": [
            "We register beneficiaries as a data processor for participating partner organizations. "
        ],
        "dataPrivacySecurity": "We have a strong anti-discrimination and anti-harassment policy for our team and volunteers. We check potential partners to make sure that they have similar policies and safeguarding in place.  We collect no data on our website. We are not a content or interaction platform. This is more about logistical cooperation in the field for humanitarian aid."
    },
    "userContent": {
        "contentManagement": "Content is NOT collected NOT stored and NOT distributed.",
        "contentTypes": [],
        "contentManagementPolicy": ""
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "Yes",
        "harassmentPolicy": "For our users, this is not relevant as its not a content or interaction platform. We have a due diligence check to ensure that our solution isn't used for military purposes and that our partners have protection and safeguarding policies in place. For our team, we do not accept any underage people. Our platform is about logistical cooperation in the field for humanitarian aid and fair distribution of aid goods."
    },
    "locations": {
        "developmentCountries": [
            "Germany",
            "Greece",
            "Netherlands",
            "United Kingdom"
        ],
        "deploymentCountries": [
            "Bosnia and Herzegovina",
            "Germany",
            "Greece",
            "Italy",
            "Lebanon",
            "Poland",
            "Serbia",
            "Slovakia"
        ]
    },
    "awardsReceived": [
        "We were awarded ANBI status in April 2023 for our continuous work around the creation of public good through Boxtribute. This can be seen here: https://drive.google.com/file/d/1zNDom1yQ3r-v5hQEn4RnAyBsz8vvUDdv/view?usp=sharing"
    ],
    "platformIndependence": {
        "isPlatformIndependent": "Yes",
        "openAlternatives": [
            "A question regarding our dependency on Auth0 was referenced in our previous application (#10565).\r\n\r\nAs you note",
            " we could in principle switch the implementation to use a generic OIDC library instead of specifically using Auth0 libraries",
            " most likely via https://github.com/thephpleague/oauth2-client in the case of our PHP app. For authorization",
            " we utilise Auth0's role based access controls (RBAC) and push both roles and role assignments to Auth0. Unfortunately there are no RBAC standards for syncing these to our knowledge and as such",
            " these would always be more tightly coupled to the provider. Given Keycloak also supports RBAC and has an API",
            " we currently see no reason why in principle our implementation could not be adapted to do so."
        ]
    },
    "organizations": [
        {
            "name": "Boxtribute",
            "website": "https://www.boxtribute.org/",
            "org_type": "owner",
            "contact_name": " Roanna Kong  ",
            "contact_email": "roanna@boxtribute.org"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "GDPR in the European Union\r\nNetherlands Equal Treatment Act.",
            "privacyComplianceURL": " We collect no data on our website, which can be seen on the bottom of our website. All the people who work on the project, from staff to volunteers, have to sign a confidentiality agreement: https://drive.google.com/file/d/1kASwONuUHbneCHXUuJT-YC-g5ZZ0WM5E/view?usp=sharing as well as sign data privacy guidelines: https://drive.google.com/file/d/1GogW9b5r0MPuGTNOtnwmsLYNTjj849kl/view?usp=sharing.\r\n\r\nFor all partners who use our hosted services, we have them sign a data processing agreement (https://docs.google.com/document/d/1_CbXjNLmk96A7VjLhyjh6Q1l0EIeu_BRWgMEhhHTHXI/edit?usp=sharing) as well as an annex disclosing all of our data sub-processors, as well as having them designate a GDPR contact person who is authorized to issue privacy transfer instructions to us (https://docs.google.com/document/d/1BbyW-yIrBKsHsTtOEwLiVtMnnfqjsSAQCZVWS5fgZOw/edit?usp=sharing). \r\n\r\nWe also have a dedicated GDPR email address which is limited only to authorized personnel, gdpr@boxtribute.org"
        }
    ],
    "deploymentOrganisations": "",
    "deploymentCountriesDepartments": "",
    "otherDeploymentOrganisations": ""
}
