	{
    "id": "10968",
    "name": "X-Road®",
    "sectors": [],
    "stage": "DPG",
    "categories": [
        "Open Software"
    ],
    "description": "X-Road is open-source software and ecosystem solution that provides unified and secure data exchange between organisations.",
    "website": "https://x-road.global/",
    "repositories": [
        {
            "name": "main",
            "url": "https://github.com/nordic-institute/X-Road"
        }
    ],
    "sdgs": {
        "sdg": [
            "SDG1: End Poverty in all its forms everywhere",
            "SDG3: Good Health and Well-Being",
            "SDG7: Affordable and Clean Energy",
            "SDG8: Decent Work and Economic Growth",
            "SDG9: Industry¸ Innovation and Infrastructure",
            "SDG11: Sustainable Cities and Communities",
            "SDG13: Climate Action",
            "SDG16: Peace¸ Justice and Strong Institutions"
        ],
        "relevance": "In order to ensure more universal and affordable access to digital services for the population of developing countries, X-Road has been introduced in multiple projects around the world. X-Road is open-source software and it provides developing countries with a national data exchange infrastructure without licensing fees. By implementing X-Road, countries avoid a vendor lock-in situation and get multiple channels for support, including a global community of users.,\r\n \r\nDifferent healthcare platforms can be connected securely with X-Road which enables data exchange between private and public service providers. All the evidence regarding the data exchange is stored locally by the data exchange parties, and no third parties have access to the data. Steps are being taken to introduce X-Road on a global basis, to allow either the World Health Organization (WHO) or its member states to set up various cross-border services to help the global community emerge faster from the COVID-19 health and economic crisis.,\r\n \r\nEnergy efficiency, renewables and consumer centricity figure among the lines of action to boost the transition towards cleaner energy systems – ways of producing, delivering and consuming energy in a more sustainable way. The deployment of information technology has a significant impact on the feasibility of contemporary policy actions. X-Road is helping electricity grid operators by harmonising access to energy data. By simplifying access to data lets them focus on the solutions to achieve energy and climate goals.,\r\n \r\nX-Road enables reduction of administrative burdens by the implementation of the Once-Only Principle (TOOP). Streamlined administrative processes support economic growth and enable providing better services for the citizens. For example, in Estonia, X-Road saved 1,134 working years during the previous calendar year. X-Road helps a country to become a hassle-free environment for business and entrepreneurship, which also attracts foreign investments.,\r\n \r\nX-Road provides national core digital infrastructure for data exchange between organizations across administration sectors and business domains. Typically, the ecosystem is open for all kinds of organizations – both public and private sector organizations. Besides, X-Road can be used to implement cross-border data exchange with other countries. X-Road enables allocating resources for building digital services and fostering innovation, instead of integrating services point-to-point.,\r\n \r\nThe use of digital services reduces the need to travel between different locations which reduces traffic in the cities. When travelling is needed, digital services provide information about different transportation and route alternatives and may prioritise the most environmentally friendly alternatives. X-Road is a crucial enabler that’s needed to make numerous information systems to communicate with each other. By establishing or joining an X-Road environment, cities and municipalities can request up-to-date information from relevant public registers and increase their effectiveness.,\r\n \r\nThe Nordic Institute for Interoperability Solutions (NIIS) aims to develop X-Road the most sustainable data exchange solution in the world. The short-term goal is to focus on the X- Road software's direct and tangible environmental impacts. NIIS conducted research focusing on assessing the current emissions profile across X-Road's operations and services to give targeted recommendations for emissions reduction and sustainable business practices.,\r\n \r\nX-Road is a solution to fight against corruption and helps in building trust towards institutions. X-Road provides log records of each message sent between X-Road ecosystem member organisations. The log records provide undeniable evidence of a transaction, and they could be used in process automation to reduce manual work, increase the level of automation in various processes and make things easier for both users of different information systems and citizens. X-Road also provides many features that are required from MyData platform technology."
    },
    "openlicenses": [
        {
            "openLicense": "MIT",
            "openLicenseEvidenceURLs": "https://github.com/nordic-institute/X-Road/blob/develop/LICENSE"
        }
    ],
    "clearOwnership": [
        {
            "clearOwnershipName": "Nordic Institute for Interoperability Solutions (NIIS)",
            "clearOwnershipURL": "https://github.com/nordic-institute/X-Road/blob/develop/LICENSE"
        }
    ],
    "documentation": "https://docs.x-road.global\r\nhttps://x-road.global/resources",
    "NonPII": {
        "collectsNonPII": "Yes",
        "nonPIIAccessMechanism": "The non-PII data can be exported from the system using the X-Road Operational Monitoring Protocol:\r\nhttps://docs.x-road.global/OperationalMonitoring/Protocols/pr-opmon_x-road_operational_monitoring_protocol_Y-1096-2.html"
    },
    "openStandards": [
        "RFC6960",
        "RFC3161",
        "ETSITS 102 918 https://github.com/nordic-institute/X-Road/blob/develop/doc/Architecture/arc-ss_x-road_security_server_architecture.md "
    ],
    "bestPractices": [
        "Software Development Life Cycle (SDLC):\r\nUser stories\r\nChange management using version control\r\nTest driven development using automated tests\r\nContinous Integration & Continous Deployment (CI/CD)\r\nCode review\r\nCode refactoring\r\nAgile development\r\n\r\nArchitectural Design:\r\nArchitectural Principles\r\nModularity and Maintainability\r\nReusability and Extensibility\r\nAccountability & Non-repudiability\r\nSecurity & Consented Access\r\n\r\nSoftware Architectural Styles:\r\nMultitier architecture\r\nRepresentational state transfer (REST)\r\nClient-server (multitier architecture exhibits this style)\r\nMonolithic application\r\nService-oriented\r\nComponent-based\r\nPeer-to-peer\r\nAsynchronous messaging\r\nEvent-driven\r\nDatabase-centric\r\n\r\nCloud Computing:\r\nAWS Best Practices For Cloud Environments\r\n\r\nUser Interface/ User Experience (UI /UX):\r\nHuman Centered Design Principles\r\n\r\nhttps://github.com/nordic-institute/X-Road-development\r\n\r\nFollowing the Principles for Digital Development where applicable"
    ],
    "dataPrivacySecurity": {
        "collectsPII": "PII data is collected and stored but NOT distributed.",
        "typesOfPIIDataCollected": [
            "https://www.niis.org/blog/2018/5/27/x-road-logs-basics"
        ],
        "dataPrivacySecurity": "https://x-road.global/security"
    },
    "userContent": {
        "contentManagement": "Content is collected and stored but NOT distributed.",
        "contentTypes": [
            "https://www.niis.org/blog/2018/5/27/x-road-logs-basics"
        ],
        "contentManagementPolicy": "It is the sole responsibility of the governing authorities in each country that deploy the X-Road data exchange layer. NIIS/X-Road has no role regarding the content transferred."
    },
    "protectionFromHarassment": {
        "facilitatesUserInteraction": "No",
        "harassmentPolicy": ""
    },
    "locations": {
        "developmentCountries": [
            "Estonia",
            "Finland",
            "Iceland"
        ],
        "deploymentCountries": [
            "Argentina",
            "Azerbaijan",
            "Barbados",
            "Brazil",
            "Cambodia",
            "Colombia",
            "Djibouti",
            "Dominican Republic",
            "El Salvador",
            "Estonia",
            "Ethiopia",
            "Finland",
            "Germany",
            "Iceland",
            "Japan",
            "Kyrgyzstan",
            "Madagascar",
            "Mexico",
            "Vietnam"
        ]
    },
    "deploymentCountriesDepartments": [
        "The countries mentioned above where X-Road is actively deployed (except for Japan and Germany with private deployments)."
    ],
    "otherDeploymentOrganisations": [
        "The Faroe Islands\r\nGovernment of Åland\r\nCayman Islands"
    ],
    "platformIndependence": {
        "isPlatformIndependent": "No",
        "openAlternatives": []
    },
    "organizations": [
        {
            "name": "X-Road®",
            "website": "https://x-road.global/",
            "org_type": "owner",
            "contact_name": " Ville Sirviö  ",
            "contact_email": "ville.sirvio@niis.org"
        }
    ],
    "privacy": [
        {
            "privacyCompliance": "- GDPR,- All relevant Estonian domestic laws (including Public Information Act and related regulations),- REGULATION (EU) No 910/2014 OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 23 July 2014 on electronic identification and trust services for electronic transactions in the internal market and repealing Directive 1999/93/EC.",
            "privacyComplianceURL": "https://www.niis.org/procedure-for-use-of-data-and-data-processing"
        }
    ],
    "aliases": "",
    "deploymentOrganisations": "",
    "awardsReceived": ""
}
