{
  "name": "Accessible Kazakhstan",
  "aliases": [
    "Accessible Kazakhstan online map"
  ],
  "description": "It is a model of an online map with information on accessibility of public facilities that enables people with limited mobility to navigate the public space.",
  "website": "https://doskaz.kz/",
  "license": [
    {
      "spdx": "Apache-2.0",
      "licenseURL": "https://github.com/qlt2020/doskaz/blob/main/LICENSE"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 11,
      "evidenceText": "The “Accessible Kazakhstan” map reflects the needs of those who particularly seek accessible, safe and comfortable public space, including people with disabilities, parents with small children in prams, the elderly, pregnant women, temporarily injured people and children under seven years old.  When monitoring a public facility, the owner of the facility is present, and the project team immediately notifies him or her of which elements of the facility do not meet the standards for accessibility of facilities open to the public. On the portal “Accessible Kazakhstan” one can find checklists with criteria for assessing accessibility of facilities, so that, if desired, the owners can read them and afterwards be involved in monitoring independently. Upon request, the project team develops recommendations, on the basis of which owners and government agencies start working on the adaptation of particular facilities for the aforementioned categories of citizens. Based on current data on accessibility of public facilities, comprehensive policies and plans for inclusion can be adopted and implemented. This, in turn, will reduce inequalities and accelerate achievement of other Sustainable Development Goals that affect development of an inclusive society. The world community needs qualified specialists who are able to form a barrier-free environment. It is for the purpose of training such specialists in 2019 within the framework of the “Accessible Kazakhstan” project that a unique online course “Ensuring accessibility of a public facility” was developed. The course: helps to get acquainted with legislation governing the provision of access to public facilities for people with disabilities and other population groups with limited mobility; can be used to find out what criteria accessibility of public facilities and open spaces is evaluated by; explains how to protect one’s right to a barrier-free environment; teaches how to monitor a public facility and develop recommendations for its adaptation to the needs of people with disabilities.",
      "evidenceURL": "https://cabar.asia/en/how-accessible-is-kazakhstan-for-people-with-disabilities"
    }
  ],
  "sectors": [
    "Social Protection"
  ],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "main",
      "url": "https://github.com/qlt2020/doskaz"
    }
  ],
  "organizations": [
    {
      "name": "Public fund \"Tandau Foundation\"",
      "website": "https://oft.kz",
      "org_type": "owner"
    }
  ],
  "stage": "DPG"
}
