{
  "name": "GeoPrism Registry",
  "aliases": [
    "GPR, Common Geo-Registry, CGR"
  ],
  "description": "GeoPrism Registry allows for the simultaneous hosting, management, regular update, and sharing of master lists, associated hierarchies, and geospatial data for the geographic objects core to sustainable development including public health, education, agriculture, infrastructure, and other public and private services. ",
  "website": "https://terraframe.atlassian.net/wiki/spaces/GGR/overview/",
  "license": [
    {
      "spdx": "LGPL-3.0",
      "licenseURL": "https://github.com/terraframe/geoprism-registry/blob/master/LICENSE"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 3,
      "evidenceText": "Up-to-date and historical geographic data are necessary to identify areas and populations most at risk for natural disasters or other public health emergencies; to ensure universal coverage of health, education, and other services; and to enable allocation of resources to the right places at the right time in a systematic and data-driven way.",
      "evidenceURL": "https://drive.google.com/file/d/1i_GtstNgg6hDWI-CEVP0Uk63cqGm7mHw/view"
    },
    {
      "SDGNumber": 16,
      "evidenceText": "GeoPrism Registry to stock, manage and share information that are official and non-official, actual and historic, regarding the geographic objects key to sustainable development like administrative divisions, villages, infrastructure and other relevant physical and virtual features forming our environment. The information in questions are lists, hierarchies and geospatial data accessible by any information system or user.",
      "evidenceURL": "https://drive.google.com/file/d/1i_GtstNgg6hDWI-CEVP0Uk63cqGm7mHw/view"
    }
  ],
  "sectors": [],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "geoprism-registry",
      "url": "https://github.com/terraframe/geoprism-registry"
    }
  ],
  "organizations": [
    {
      "name": "TerraFrame, Inc.",
      "website": "https://www.terraframe.com",
      "org_type": "owner",
      "contact_name": "Nathan McEachen",
      "contact_email": "nmceachen@terraframe.com"
    }
  ],
  "stage": "nominee"
}
