{
  "name": "NEONATAL NUTRITION DIGITAL ACCELERATOR KIT PROJECT",
  "aliases": [
    "NNDAK"
  ],
  "description": "The Newborn Nutrition Digital Adaptation Kit (NNDAK) system is intelligently designed using Human-Centered Design to support healthcare delivery through actively tracking, measuring and troubleshooting the feeding of vulnerable babies. The NNDAK features data collection and visualization and a major innovation that entails the babies growth chart, leveraging on the publicly available data on INTERGROWTH-21ST fetal weight Charts. The NNDAK is envisioned to streamline data collection for newborn nutrition to aid in decision-making. The data will equip mothers and health care providers with information and real-time feedback to adapt practices to optimize the provision of lifesaving milk to newborns. Guided by the WHO Standards-Based, Machine-readable, Adaptive, Requirements-based and Testable (SMART) guideline in conjunction with the Principles for Digital Development, to ensure better success in its design, development, deployment, use, support and maintenance in a sustainable manner, the NNDAK is built on Google’s Android Fast Healthcare Interoperability Resources Software Development Kit. ",
  "website": "https://www.digitalhealthatlas.org/en/-/projects/5111/published",
  "license": [
    {
      "spdx": "GPL-3.0",
      "licenseURL": "https://github.com/IntelliSOFT-Consulting/human-milk-bank/blob/main/LICENSE.md"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 3,
      "evidenceText": "The main aim of this project is to streamline data collection for newborn nutrition to aid in decision-making. The data will equip mothers and health care providers with information and real-time feedback to adapt practices to optimize the provision of lifesaving milk to newborns. This system will primarily support infant feeding through the mother’s own milk or donor human milk.  "
    }
  ],
  "sectors": [
    "Health"
  ],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "main",
      "url": "https://github.com/IntelliSOFT-Consulting/human-milk-bank"
    }
  ],
  "organizations": [
    {
      "name": "IntelliSOFT Consulting Limited",
      "website": "https://www.intellisoftkenya.com/",
      "org_type": "maintainer",
      "contact_name": "Susan Gathu",
      "contact_email": "sgathu@intellisoftkeny.com"
    }
  ],
  "stage": "nominee"
}
