{
  "name": "openBaraza",
  "aliases": [
    "openBaraza"
  ],
  "description": "Development framework for HR, Payroll, ERP, Micro Finance",
  "website": "https://openbaraza.org/",
  "license": [
    {
      "spdx": "GPL-3.0",
      "licenseURL": "https://github.com/OpenBaraza/openBaraza/blob/main/license.txt"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 3,
      "evidenceText": "Our Mobile Decision Support System (mDSS) application is developed on the openBaraza platform. In line with the Sustainable Development Goals No: 3 - Ensure healthy lives and promote well-being for all at all ages. In particular, SDG 3.1 the mDSS application can definitely play a part in reducing maternal mortality ration to less than 70 per 100,000 live births by 2030. \nThe mDSS mobile app is an Android app that installs from the phone and runs as an application. The app is hosted and is accessible for download via the Internet automatically to the user handset. Once installed, the handset and the application are configured with the credentials of the Community Health Volunteer (CHV) including username and password, which are linked with the operating phone number. This setup allows the system to register and associate collected records to the respective CHV; useful for reporting and analysis purposes. When visiting Households for data collection, by initiating a new record the system automatically picks the geolocation of the household and associates it with the record. The CHV will complete the respective indicator form and save the information at any stage on the handset. This method allows the CHV to continue collecting more information and only submit the completed form to the server over the Internet. Where the handset detects that the Internet is not available for one reason or the other, the completed forms will be stored in the phone and only be relayed to the server when the network is available. Because the application is in communication with the server in real-time, any update of the data is immediately available to the CHVs. The application is preconfigured with danger signs for both mother and newborn as defined by the WHO. When any of the danger signs is picked by the system, the CHV is immediately flagged so as to refer the patient to a Facility within the network. The system is to be setup in such a way that the CHV will not be allowed to proceed and complete the forms until the referral is done. This information will be available to all the facilities. The patient will be able to visit any of the networked Facilities for treatment. This information is also relayed to the rest of the other Facilities and a record of the visit is kept in the server. Within 24 hours if the patient has not been seen in any of the networked facilities, an SMS message is relayed to the respective CHV handset. At this point, the CHV should follow up with the patient. When the Patient visits the Facility, using the Household number and the name he/she is identified and treated. The Clinician is able to record the treatment in the Patient’s information, which is recorded in the Server. Both the CHV and the Clinician’s information are available to the Reviewer in real time from the web. The Reviewers role would be to assess the CHV’s reason for referral and the Clinician’s final diagnosis for correctness. The feedback from the Reviewer will be available and shared on a monthly basis during review meetings. mDSS Solution CHV (Mobile App) Renders the mDSS data collection tools to the CHV mobile handset. Allows for completion and submission of the information to the mDSS Server mDSS Server A database driven web application that acts as a host for the collected information. It also has a web interface for data manipulation by the Facility and Reviewer. The mDSS server application incorporates an application logic component that connects with the SMS and email gateways. This allows for real-time communication of certain critical indicators to the respective recipients. For example, where a patient has not shown up at the referred facility, the CHV will be alerted. Facility (web access) This module is accessible at the Facility via the web. The application allows the Clinician to treat the patient and record the treatment. Reviewer (web access) Also accessible via the web, this module provides the reviewer a view to assess both the CHV referral report and the clinicians diagnosis. It is based on this analysis that a decision is measured."
    },
    {
      "SDGNumber": 9,
      "evidenceText": "In response to SDG No: 9 Industry Innovation and Infrastructure, and in particular, SDG 9.3 - Increase the access of small-scale industrial and other enterprises, in particular in developing countries, to financial services, including affordable credit, and their integration into value chains and markets, the barazaLender loans management platform by DewCIS is one such solution. \nThe barazaLender is web and mobile application of credit management tools, complete with API integration points to credit scoring institutions, financial statement analysis, credit limit modeling, collection monitoring and management, and robust database reporting, supported by mPesa payment integration for disbursements. \nThe barazaLender Risk Rating inform the quality of a customer, but can also be used to drive models that recommend appropriate credit limits and terms for each individual borrower. In addition, where every borrower in the system has a score, the lenders can efficiently report on the risk of Accounts Receivable Portfolio. \nThe barazaLender clearly puts you in charge of your scoring models, providing the ability for unlimited scorecards and unlimited scoring items that are defined and weighted by you. The scoring scale can be simple or complex, and the resulting quality score can be translated into an Internal Rating for ease of understanding outside the credit department. Non-financial indicators including farm assets, livestock, experience and outside ratings, financial data and predictive elements can all be incorporated into custom scoring models. \n Faced with the immediacy of local challenges, borrowers usually need credit decision in minutes, rather than in days. By utilizing models that incorporate factors such as the borrower’s risk, industry high credit, and/or financial stability, barazaLender’s Approval Management Workflow will guide decision-making through the approval process. \nWith barazaLender’s rules-based workflow, the productivity of collectors is greatly improved and with this comes sustainability of the enterprise. Ability to define collection strategies to prioritise the accounts that should receive attention first, improves the efficiency of the team and ensure compliance. \nTaking advantage of the availability of mobile phones in Kenya, funds disbursements using mPesa payment is not only immediate but also very convenient even to those remote parts of the country."
    },
    {
      "SDGNumber": 17,
      "evidenceText": "As regards SDG No:17 Partnerships for the goals and in particular Target No: 17.1 Enhance availability of reliable data. The call for enhanced capacity-building support to developing countries, including for least developed countries and small island developing States, to increase significantly the availability of high-quality, timely and reliable data disaggregated by income, gender, age, race, ethnicity, migratory status, disability, geographic location and other characteristics relevant in national contexts is very relevant in our Baraza Human Capital Management (HCM) application in many ways than one. \n By keeping accurate, stratified and well-defined employee bio data including gender, age, experience and pay, relevant references can be quickly and accurately be extracted. With structured data of pay grade among various gender for example, incisive discussions can made as to why one gender seems to be earning much more than the other whereas both have the same experience. This sort of accurate data is very useful not only within the organization but even to policy makers including government and non-governmental organizations. \nEquality at work place can be easily enforced without bias because historical data showing the levels of experience supported by continuous appraisal exercises kept in Baraza HCM employee record can be referenced at any time. With this level of transparency, staffs have the confidence to work in an equal environment without discrimination of any sort. \nIssues such as employment of child labour would not even arise when using Baraza HCM because the system would not validate employee record of underage entries. This sort of checks and balances would guard against both forced and child labour which is very prevalent in menial and labour intensive engagements. \nThe Baraza HCM payroll and deductions modules enables for simplified and transparent computations of deductions including income tax, social security levies, insurance funds etc supporting revenue collection and boost fiscal policies. With available API integrations points, these deductions can be remitted to the relevant authorities without direct human intervention, which help in reducing errors and avoid work duplications."
    }
  ],
  "sectors": [],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "openBaraza",
      "url": "https://github.com/OpenBaraza/openBaraza"
    }
  ],
  "organizations": [
    {
      "name": "Dew CIS Solutions Ltd",
      "website": "https://www.dewcis.com/",
      "org_type": "owner",
      "contact_name": "Dennis Gichangi",
      "contact_email": "dennis.gichangi@dewcis.com"
    }
  ],
  "stage": "nominee"
}
