{
  "name": "Safecast",
  "description": "Safecast is an international volunteer driven non-profit organization whose goal is to create useful, accessible, and granular environmental data. All Safecast data is published, free of charge, into the public domain under a CC0 designation.",
  "website": "https://safecast.org/",
  "license": [
    {
      "spdx": "CC0-1.0",
      "licenseURL": "https://safecast.org/about/licenses/"
    },
    {
      "spdx": "MIT",
      "licenseURL": "https://safecast.org/about/licenses/"
    },
    {
      "spdx": "CC-BY-NC-3.0",
      "licenseURL": "https://safecast.org/about/licenses/"
    },
    {
      "spdx": "BSD-3-Clause",
      "licenseURL": "https://safecast.org/about/licenses/"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 3,
      "evidenceText": "By helping people get access to reliable, open data about their environments, Safecast is helping people make educated decisions about their health and well-being.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 4,
      "evidenceText": "Safecast’s educational outreach programs and partnerships provide hands-on learning for primary and secondary students to gain skills in engineering and environmental topics that will support future job opportunities and entrepreneurship. Our open and free curriculum ensures that educators have access to affordable and relevant resources.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 5,
      "evidenceText": "Safecast’s global volunteer team is reflective of the demographics they serve. We are committed to encouraging and fostering a diverse and inclusive community.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 9,
      "evidenceText": "Open platforms build resiliency in both communities that lack government support and infrastructure and those with a high GDP. As leadership and budgets change, open, transparent, community-driven innovation, particularly with regards to measuring the environment and climate change, is essential to the continuity and longevity of a critical system. Safecast’s unbiased open platform is adopted by research institutions around the world and the data is endorsed as reliable and accurate.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 11,
      "evidenceText": "Safecast’s openly licensed data platform provides community stakeholders in towns and cities around the world full access to information that they can use to make informed lifestyle choices and influence local policy and legislation.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 13,
      "evidenceText": "Air Quality and particulate matter have been identified as significant health factors by the World Health Organization. Safecast is building a network of sensors to monitor PM1.0, PM2.5, PM 10 that is available for anyone to use for free with no licensing restrictions.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 15,
      "evidenceText": "Safecast is committed to helping people better understand their environment which is interconnected with the ecosystems we share with other living organisms and nonliving objects.",
      "evidenceURL": "https://safecast.org/sdg/"
    },
    {
      "SDGNumber": 17,
      "evidenceText": "As an open project, Safecast proudly works with groups across the social and political spectrum and models how to globally scale the dissemination and sharing of information, knowledge, expertise, and technology through open standards.",
      "evidenceURL": "https://safecast.org/sdg/"
    }
  ],
  "sectors": [
    "Big Data",
    "Climate",
    "Civil society",
    "Data Collection",
    "Education",
    "Health"
  ],
  "type": [
    "software",
    "data"
  ],
  "repositories": [
    {
      "name": "main",
      "url": "https://github.com/Safecast/safecastapi"
    }
  ],
  "organizations": [
    {
      "name": "Safecast",
      "website": "https://safecast.org/",
      "org_type": "owner",
      "contact_email": "sean@safecast.org"
    }
  ],
  "stage": "nominee"
}
