{
  "name": "ur-scape",
  "aliases": [
    ""
  ],
  "description": "ur-scape is an open-source spatial planning tool designed to support sustainable futures in rapidly developing urban and rural regions where data is often difficult to access and uneven in quality, and where development needs are especially urgent and challenging. ur-scape does this by bringing diverse kinds of data together and encouraging people to explore the data intuitively and in real-time.  ur-scape helps city makers, be they governments, businesses or communities, improve the quality of planning and design decisions. It helps develop liveable neighbourhoods, build responsive towns, reduce city ‘stress points’ (flooding, traffic snarls, poverty) and enhance ‘sweet spots’ (accessible, equitable, economically vibrant), and progress towards strategic development goals (regional, national and SDGs).  Developed by the Urban-Rural Systems (URS) team at Future Cities Laboratory (FCL), ur-scape is supported by the Asian Development Bank (ADB) and the Swiss Secretariat for Economic Affairs (SECO). Pilot implementation of the ur-scape tool is supported by the municipal planning authorities of the city of Bandung, the Indonesian Ministry of Agrarian Affairs and Spatial Planning (MASP), and the Bauhaus Weimar University.",
  "website": "https://urs.sec.sg/",
  "license": [
    {
      "spdx": "MIT",
      "licenseURL": "https://github.com/UrbanRuralSystems/ur-scape/blob/master/LICENSE"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 11,
      "evidenceURL": "https://urs.sec.sg/category/about-ur-scape/"
    }
  ],
  "sectors": [],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "main",
      "url": "https://github.com/UrbanRuralSystems/ur-scape"
    }
  ],
  "organizations": [
    {
      "name": "Singapore ETH Centre (SEC)",
      "website": "https://sec.ethz.ch/",
      "org_type": "maintainer",
      "contact_name": "Yuhao Lu",
      "contact_email": "yuhao.lu@sec.ethz.ch"
    },
    {
      "name": "Asian Development Bank (ADB)",
      "website": "https://www.adb.org/",
      "org_type": "funder"
    },
    {
      "name": "Swiss State Secretary for Economic Affairs (SECO)",
      "website": "https://www.seco.admin.ch/seco/en/home.html",
      "org_type": "funder"
    }
  ],
  "stage": "nominee"
}
