{
  "name": "Detroit water project",
  "aliases": [
    ""
  ],
  "description": "Detroit Water Project attempts to throw a life-preserver to those drowning in unpaid water bills by connecting donors to those in need. This allows homeowners to, in a sense, crowdsource their water bill. Donors can either pay the entire unpaid balance, which can be several thousand dollars, or just part of a bill. Since its launch, the company has expanded to Baltimore with the Baltimore Water Project.",
  "website": "https://detroitwaterproject.org/",
  "license": [
    {
      "spdx": "MIT",
      "licenseURL": "https://github.com/humanutility/detroit-water-project/blob/master/LICENSE"
    }
  ],
  "SDGs": [
    {
      "SDGNumber": 1,
      "evidenceText": "The Detroit water project is aimed toward helping families to donors to pay off their water bills thereby enabling them to focus their attention and funds to improving thee lives of there families without being worried about not getting access to water.",
      "evidenceURL": "https://medium.com/the-human-utility-blog/hope-against-hardship-how-determination-and-the-human-utility-helped-a-mother-fight-hopelessness-14fea6d93bab"
    },
    {
      "SDGNumber": 6,
      "evidenceText": "Help can come from anywhere. And people in Detroit need help. In 2014 the City of Detroit was in the middle of the largest municipal bankruptcy in U.S. history and the city aggressively started turning off water to delinquent accounts in a desperate attempt to right the city’s finances. More than 33,000 consumers had their water shut off in 2014 alone. The Detroit water project is a non profit organization that helps to link donors to families that needs to pay off their water utility bills.  ",
      "evidenceURL": "https://techcrunch.com/2015/03/18/the-detroit-water-project-connect-donors-to-unpaid-water-bills/"
    }
  ],
  "sectors": [],
  "type": [
    "software"
  ],
  "repositories": [
    {
      "name": "main",
      "url": "https://github.com/humanutility/detroit-water-project"
    }
  ],
  "organizations": [
    {
      "name": "The Human Utility",
      "website": "https://humanutility.org/",
      "org_type": "implementer"
    }
  ],
  "stage": "nominee"
}
